 -----------（0目前的动画方式,1新的）
animationMode = 1

-------------(内存是否充足，用于释放内存控制)
phoneMemoryEnough = true

------------(待机是否自由移动)
fightingMoveMode = 1 ---（0移动,1固定不移动）

___is_open_leadname = true   --  开启主角名称使用系统字库（繁体）

-----------------------连击条绘制坐标（X,Y，正右，负左，正上，负下）
qtePosition = {
	"536,370",----------------1
	"556,290",----------------2
	"536,220",----------------3
	"636,370",----------------4
	"656,290",----------------5
	"636,220",----------------6
	"556,290",----------------默认位
}

-------------------------资源抢夺初始坐标（X,Y）
capture_resource = {
	"0,784",----------------（第一排第一个点）（左上角为第一排）
    "-220,672",----------------（第二排第一个点）
}

----------------等级奖励（领取等级,奖励类型,奖励ID,奖励数量）
levelReward = {
	"6,7,13,1",------------------------七星宝刀
	"16,6,73,1",-----------------------橙色数码兽卡
	"20,2,-1,1000",--------------------1000钻石
}
----------------等级奖励开关（0关闭，1开启）
levelRewardMode = 1

-----------------------男女主角普攻光效ID
user_skill_effic_id = {
327,
214,
}


-----------------------男女主角默认语音ID
user_voice_id = {
55013,
55113,
}

---------------------------成就分页（分页名称，分页图标索引，是否显示（0显示，-1不显示））
achieveName = {
	{"冲级达人",11,0,1},----------------1
	{"完美通关",1,0,2},-----------------2
	{"战力提升",3,0,3},-----------------3
	{"战力爆表",3,-1,4},-----------------4
	{"特权在手",13,0,5},-----------------5
	{"神兵利器",5,0,6},-----------------6
	{"宝物秘籍",4,0,7},-----------------7
	{"最强阵容",12,0,8},-----------------8
	{"荡平罗刹",9,0,9},-----------------9
	{"无之境地",6,0,10},-----------------10
	{"拔刀相助",7,-1,11},-----------------11
	{"惩恶扬善",9,0,12},-----------------12
	{"攒星达人",10,-1,13},-----------------13
	{"跃迁之力",6,-1,14},-----------------14
	{"精英通关",1,-1,15},-----------------15
}

-- 下载更新包提示
update_download_info = "正在玩命更新%s数据"

--------------------------------------------抢夺战斗背景音乐
battle_fight_type_10_bg_music = 2
--------------------------------------------竞技场战斗背景音乐
battle_fight_type_11_bg_music = 2

spineAnimations = {
	"00_daiji",-----------------------待机			0
	"01_qianchong",-------------------前冲			1
	"02_huichong",--------------------回冲			2
	"01_qianchong",-------------------前冲			3
	"00_daiji",-----------------------待机			4
	"03_beiji",-----------------------被击			5
	"03_beiji",-----------------------被击			6
	"04_kbeiji",----------------------空中被击		7
	"04_kbeiji",----------------------空中被击		8
	"02_huichong",--------------------回冲			9
	"05_xuanyun",---------------------眩晕			10
	"06_siwang",----------------------死亡			11
	"06_siwang",----------------------死亡			12
	"06_siwang",----------------------死亡			13
	"07_pugong",----------------------普攻			14
	"08_jineng",----------------------技能			15
	"12_heti",------------------------合击			16
	"00_daiji",-----------------------待机			17
	"01_qianchong",-------------------前冲			18
	"11_xialuo",----------------------下落			19
	"00_daiji",-----------------------待机			20
	"01_qianchong",-------------------前冲			21
	"02_huichong",--------------------回冲			22
	"02_huichong",--------------------回冲			23
	"00_daiji",-----------------------待机			24
	"09_kzputong",--------------------空中/对空普攻	25
	"10_kzjineng",--------------------空中/对空技能	26
	"28_ddsiwang",--------------------倒地死亡		27
	"31_ji1",-------------------------单体技能		28
	"32_ji2",-------------------------一列技能		29
	"33_ji3",-------------------------横排技能		30
	"34_ji4",-------------------------全体技能		31
	"35_ji5",-------------------------加血技能		32
	"36_ji1",-------------------------空中单体技能	33
	"37_ji2",-------------------------空中一列技能	34
	"38_ji3",-------------------------空中横排技能	35
	"39_ji4",-------------------------空中全体技能	36
	"40_ji5",-------------------------空中加血技能	37
	"13_jueji",-----------------------绝技攻击		38
	"29_daodi",-----------------------浮空倒地		39
}

effectAnimations = {
	"animation",
	"animation2",
	"animation3",
}


npcAnimationsNew = {
	"animation1",
	"animation2",
	"animation3",
	"animation4",
	"animation5",
	"animation6",
	"animation7",
	"animation8",
	"animation9",
	"animation10",
}

npcAnimations = {
	"animation_standby",
	"animation_click",
}

---------------------------------------合体技图标的动画参数
fight_heti_icon_precent = {
	"0,0",
	"0.9,22",
	"1,42",
	"0.85,68",
	"0,0",
}

-- talking data app_id
jttd_app_id = "C042F20ACC52530B739322FCCBABC000"

-- 七日活动奖励的数码兽信息
_seven_day_activity_reward_hero_ids = {
    232, -- 韦陀
    364, -- 烈阳神 
    485, -- 剑魔连城
    573, -- 金鹏
}

-- 龙虎门的项目中添加镜头的控制参数（人物横向间距，人物纵向间距，背景缩放比例，远景缩放比例，地表缩放比例，近景缩放比例）
_camera_controller = {
	--{_half_width = 400, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1, _far_view_scale=1.199578, _earth_view_scale=1.498681, _near_view_scale=1.996485}, ----------角色150%
	--{_half_width = 560, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1, _far_view_scale=1.110459, _earth_view_scale=1.248352, _near_view_scale=1.425345}, ----------角色125%
	--{_half_width = 640, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.1, _far_view_scale=1.044118, _earth_view_scale=1.092308, _near_view_scale=1.145161}, --------角色110%
	--{_half_width = 660, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.09, _far_view_scale=1.036496, _earth_view_scale=1.075758, _near_view_scale=1.118110}, -------角色107.5%
	--{_half_width = 680, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.08, _far_view_scale=1.024346, _earth_view_scale=1.049908, _near_view_scale=1.076777}, -------角色105%
	--{_half_width = 700, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.07, _far_view_scale=1.012478, _earth_view_scale=1.025271, _near_view_scale=1.038391}, -------角色102.5%
	--{_half_width = 720, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.06, _far_view_scale=1.000000, _earth_view_scale=1.000000, _near_view_scale=1.000000}, ---------角色100%
	--{_half_width = 880, _half_height = 360, _move_height=240*1.25, _width = 2272, _height = 1280, _background_scale=1.05, _far_view_scale=0.922827, _earth_view_scale=0.856712, _near_view_scale=0.799437}, ---------角色85%
	--{_half_width = 1040, _half_height = 580, _move_height=240*1.00, _width = 2272, _height = 1280, _background_scale=1.04, _far_view_scale=0.856712, _earth_view_scale=0.749340, _near_view_scale=0.665885}, --------角色75%
	{_half_width = 720, _half_height = 240, _move_height=240*1.50, _width = 2272, _height = 1280, _background_scale=1.06, _far_view_scale=1.000000, _earth_view_scale=1.000000, _near_view_scale=1.000000}, ---------角色100%
	{_half_width = 880, _half_height = 360, _move_height=240*1.25, _width = 2272, _height = 1280, _background_scale=1.05, _far_view_scale=0.922827, _earth_view_scale=0.856712, _near_view_scale=0.799437}, ---------角色85%
	{_half_width = 1040, _half_height = 580, _move_height=240*1.00, _width = 2272, _height = 1280, _background_scale=1.04, _far_view_scale=0.856712, _earth_view_scale=0.749340, _near_view_scale=0.665885}, --------角色75%
	{_half_width = 1200, _half_height = 600, _move_height=240*0.75, _width = 2272, _height = 1280, _background_scale=1.03, _far_view_scale=0.798875, _earth_view_scale=0.665105, _near_view_scale=0.569709}, --------角色66%
	{_half_width = 1360, _half_height = 820, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.02, _far_view_scale=0.748353, _earth_view_scale=0.597895, _near_view_scale=0.497809}, --------角色60%
	{_half_width = 1680, _half_height = 820, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.01, _far_view_scale=0.666667, _earth_view_scale=0.500000, _near_view_scale=0.400000}, --------角色50%
	{_half_width = 2272, _half_height = 1280, _move_height=240*0.50, _width = 2272, _height = 1280, _background_scale=1.1, _far_view_scale=0.666667, _earth_view_scale=0.500000, _near_view_scale=0.400000}, --------角色50%
}

-- 战斗控制参数
_battle_controller = {
	_role_movd_smallest_distance = 10, --角色发动攻击需要移动到目标点时，与目标点距离大于此像素才调用移动动作，否则直接发动攻击
	_draw_hit_damage_duration = 2, --绘制连击数的等待时间(秒)
	_melee_hit_distance = 2, --1格为80像素，此距离表示多少格1就是1格，0.5就是半格
	_random_move_time = {0.0, 0.0, 0.0, 0.0}, --同时出手随机值（用于拉开攻击时间差）
	_explode_effice_id = 777, --终结一击炸开光效的ID
	_dead_effice_id = 199, --角色死亡光效的ID
	_vertigo_effice_id = -1, -- 52, --角色眩晕光效的ID
	_invincible_effice_id = -1, -- 54, --角色无敌，增加防御光效的ID
	_burn_effice_id = -1, -- 51, --角色燃烧光效的ID
	_poisoning_effice_id = -1, -- 53, --角色中毒光效的ID
	_back_jump_distance = 160, --闪避时后跳的距离（像素）
	_back_base_pos_distance = 560,--被击方剩余阵营区域范围
	_back_base_pos_cell_distance = 240,--多段返回出生点的距离
	_back_base_pos_wait_time = 0.1,--多段返回出生点的等待时间(秒)
	_camp_space = 120,--阵营间的间距
	_camp_attack_space = 160,--角色攻击的活动间距
	_back_base_pos_start_min_wait_time = 100,--战斗开始时移动启动的随机时间最小值（毫秒）
	_back_base_pos_start_max_wait_time = 500, --战斗开始时移动启动的随机时间最大值（毫秒）
	_back_base_pos_moving_min_wait_time = 100,--战斗中时移动启动的随机时间最小值（毫秒）
	_back_base_pos_moving_max_wait_time = 100,--战斗中时移动启动的随机时间最大值（毫秒）
	_shadow_max_height = 300,--投影最大显示高度，到达这个高度会全透明显示
	_shadow_max_proportion = 50,--投影的最大放大比例（%），到达最高点会放大到这个比例
	_air_pursuit_min_height = 50,--空中追击最低高度限制，目标超过此高度才会调用25，26空中攻击动作
	_air_hurt_min_height = 10,--浮空被击动作调用的最低高度限制，目标超过此高度才会调用空中被击动作
	_air_pursuit_change_posX = 0,--空中追击，追击者位置修正偏移值（X）
	_air_pursuit_change_posY = 0,--空中追击，追击者位置修正偏移值（Y）
	_byattck_flight_height = 1000,--------浮空高度上限（基于出生点）
	_byattck_flight_width = 200,--------击飞距离上限（基于出生点）
	_screen_scale_min = 0.8,------------------镜头拉远最大限制（地图大小：100%=1，80%=0.8）
	_solid_position = {fwin._height / 2, fwin._height / 4, 0}, ---------------镜头缩放的基准点（左上,中，左下）
	_rebound_distance = 0,--------------------------版边反弹距离
}


-- 跑动距离与速度控制
_run_controller = {
	{_run_distance = 0 , _run_time = 0.0}, --单位：像素，秒
	{_run_distance = 40, _run_time = 0.2}, --单位：像素，秒
	{_run_distance = 60, _run_time = 0.22}, --单位：像素，秒
	{_run_distance = 80, _run_time = 0.24}, --单位：像素，秒
	{_run_distance = 100, _run_time = 0.26}, --单位：像素，秒
	{_run_distance = 120, _run_time = 0.28}, --单位：像素，秒
	{_run_distance = 140, _run_time = 0.30}, --单位：像素，秒
	{_run_distance = 160, _run_time = 0.32}, --单位：像素，秒
	{_run_distance = 180, _run_time = 0.34}, --单位：像素，秒
	{_run_distance = 200, _run_time = 0.36}, --单位：像素，秒
	{_run_distance = 220, _run_time = 0.38}, --单位：像素，秒
	{_run_distance = 240, _run_time = 0.40}, --单位：像素，秒
	{_run_distance = 260, _run_time = 0.42}, --单位：像素，秒
	{_run_distance = 280, _run_time = 0.44}, --单位：像素，秒
	{_run_distance = 300, _run_time = 0.46}, --单位：像素，秒
	{_run_distance = 320, _run_time = 0.48}, --单位：像素，秒
	{_run_distance = 340, _run_time = 0.50}, --单位：像素，秒
	{_run_distance = 360, _run_time = 0.52}, --单位：像素，秒
	{_run_distance = 380, _run_time = 0.54}, --单位：像素，秒
	{_run_distance = 400, _run_time = 0.56}, --单位：像素，秒
	{_run_distance = 99999, _run_time = 0.56}, --单位：像素，秒
}


-- 所有tip信息内容
_All_tip_string_info = {
	_warriorName = "数码兽",
	_energyName = "体力", -- 体力
	_fuelName = "精力", --精力/精力
	_fundName = "金币",
	_crystalName = "钻石",
	_fetterName = "羁绊",
	_decomposeName = "回收",
	_rebirthName = "退化",
	_wrestleName = "竞技场",
	_recruitPropName = "普通招募书",
	_expPropName = "金经验兽",
	_fuelPropName = "体力丸",
	_expName = "战队经验",
	_reputation = "竞技币",
	_equip = "装备",
	_treasure = "宝物",
	_glories = "试炼币",
	_soulName = "天赋点",
	_destiny = "芯片",--天命
	_hero = "天赋点",
	_exploit = "试炼币",
	_union_exploit = "公会币",
	_winName= "胜点",
	_integralName= "积分",
	_arena= "擂台赛奖励",
	_juexingsuipian = "觉醒碎片",
}


--------------资源获取途径
user_resource_info = {
	_silver_to_get_index = {306,307,308,309,310},----------------金币
	_reputation_to_get_index = {125},------------声望
	_glories_to_get_index = {126},---------------荣誉
	_soul_to_get_index = {123,124},------------------兽魂
	_exploit_to_get_index = {127},---------------战功
	_hero_to_get_index = {306,307,308,309,310},------------------将魂
}


-- 月卡显示信息
_month_card_tip = {
	"立即获得%d钻石，连续%d天每天可领取%d钻石%s！",
	"每天可领取%d钻石%s，剩余%d天",
	"恭喜您购买%d元月卡成功！\r\n每日都可以领取免费资源哟！",
	"领取成功，恭喜您获得%d钻石%s！",
}

-- 所有tip信息内容描述
_All_tip_string_info_description = {
	_warriorNameDescription = "数码兽",
	_divineNameDescription = "灵异探险",
	_energyNameDescription = "挑战关卡需要消耗体力",---------------------【数码宝贝】体力描述
	_fuelNameDescription = "精力",
	_fundNameDescription = "游戏中的主要货币",---------------------------------【数码宝贝】金币描述
	_crystalNameDescription = "世间万物皆可明码标价",------------------------------【数码宝贝】钻石描述
	_soulJadeNameDescription = "分解数码兽可获得兽魂，可在神秘商店兑换稀有道具",---------------将魂描述
	_steelSoulNameDescription = "兽魂",
	_strengthNameDescription = "物防",
	_defenseNameDescription = "魔防",
	_fetterNameDescription = "羁绊",
	_decomposeNameDescription = "回收",
	_rebirthNameDescription = "退化",
	_wrestleNameDescription = "竞技场",
	_machineryPagodaNameDescription = "地狱之门",
	_duelNameDescription = "决斗",
	_silverBossNameDescription = "黄金大虚",
	_recruitLevelOneDescription = "普通招募",
	_recruitLevelTwoDescription = "高级招募",
	_recruitLevelThreeDescription = "阵营招募",
	_recruitPropNameDescription = "普通招募书",
	_expPropNameDescription = "金经验兽",
	_fuelPropNameDescription = "体力丸",
	_expNameDescription = "战队经验",
	_reputationDescription = "竞技场获得，用于竞技商店购买道具",----------------【数码宝贝】竞技币描述
	_equipDescription = "装备",
	_treasureDescription = "宝物",
	_gloriesDescription = "数码试炼获得，用于试炼商店购买道具",-----------------------【数码宝贝】试炼币描述
	_lackHeadtip= "缺少上阵数码兽！",
	_equip= "分解装备可获得荣誉，可在装备商店兑换稀有道具",
	_exploitDescription= "光丘守护后可获得功勋，用于在战功商店进行消费",
	_unionDescription= "用于在公会商店兑换资源",-----------------------【数码宝贝】公会币描述
	_winNameDescription= "通过跨服擂台赛获得，可在胜点商店兑换稀有数码兽和道具",-----------------------胜点描述
	_integralNameDescription= "通过跨服擂台赛获得，可在积分商店兑换稀有数码兽和道具",-----------------------积分描述
	_arenaDescription= "打开有惊喜！",-----------------------擂台赛奖励描述
	_talentPointTip= "可用于提升天赋等级",-----------------------【数码宝贝】天赋点描述
	_vipExpDescription = "用于提升VIP等级",----------------------【数码宝贝】VIP经验描述
}
--数码魂
_supernaturalSoul = "分解跃迁道具可获得数码魂，可在跃迁商店兑换跃迁道具"


-- VIP特权说明文字
_vip_privilege_info = {
	privilege_one = "累计充值%|1|60%钻石即可享受该特权\r\nV1首冲大礼包：%|1|巴多拉兽（全屏秒杀）%\r\n每天可购买体力%|1|3%次\r\n每日可使用点金手%|1|5%次\r\n每天重置精英关卡次数%|1|1%次",
	privilege_two = "累计充值%|1|300%钻石即可享受该特权\r\nV2超值大礼包：%|1|装备宝箱钥匙（有机会获得稀有装备材料）%\r\n可以激活%|1|月卡%福利，激活后能在每日活动中领取%|1|100钻石福利（31天）%\r\n每天可购买体力%|1|4%次\r\n每日可使用点金手%|1|7%次\r\n每天重置精英关卡次数%|1|2%次\r\n包含V1所有内容",
	privilege_three = "累计充值%|1|600%钻石即可享受该特权\r\nV3超值大礼包：%|1|觉醒合金（装备觉醒必备材料）%\r\n%|1|技能点回复时间降至1分/点%\r\n每天可购买体力%|1|5%次\r\n每日可使用点金手%|1|9%次\r\n每天重置精英关卡次数%|1|2%次\r\n包含V2及以下所有内容",
	privilege_four = "累计充值%|1|1000%钻石即可享受该特权\r\nV4超值大礼包：%|1|风系指环之魂（巴鲁兽觉醒指环）%\r\n可以激活%|1|至尊月卡%福利，激活后能在每日活动中领取%|1|100钻石福利（31天）%\r\n%|1|开启扫荡10次功能%\r\n每天可购买体力%|1|6%次\r\n每日可使用点金手%|1|12%次\r\n每天重置精英关卡次数%|1|2%次\r\n包含V3以下所有内容",
	privilege_five = "累计充值%|1|2000%钻石即可享受该特权\r\nV5超值大礼包：%|1|4星巴多拉兽%\r\n开启每日任务：%|1|豪华返利（钻石超值回馈）%\r\n每天可购买体力%|1|7%次\r\n每日可使用点金手%|1|16%次\r\n每天重置精英关卡次数%|1|3%次\r\n竞技场跳过战斗无冷却时间\r\n可在研究所进行至尊捐献\r\n包含V4及以下所有内容",
	privilege_six = "累计充值%|1|3000%钻石即可享受该特权\r\nV6超值大礼包：%|1|数码迷你机之魂（巴多拉兽觉醒神圣计划）%\r\n%|1|开启扫荡50次功能%\r\n%|1|竞技场战败积分同样+2%\r\n每天可购买体力%|1|8%次\r\n每日可使用点金手%|1|20%次\r\n每天重置精英关卡次数%|1|3%次\r\n包含V5及以下所有内容",
	privilege_seven = "累计充值%|1|5000%钻石即可享受该特权\r\nV7超值大礼包：%|1|5星巴多拉兽%\r\n%|1|数码试炼积分增加10％%\r\n每天可购买体力%|1|9%次\r\n每日可使用点金手%|1|25%次\r\n每天重置精英关卡次数%|1|3%次\r\n包含V6及以下所有内容",
	privilege_eight = "累计充值%|1|7000%钻石即可享受该特权\r\nV8超值大礼包：%|1|炎系指环之魂（巴多拉兽觉醒指环）%\r\n开启每日任务：%|1|送装备宝箱钥匙%\r\n每天可购买体力%|1|10%次\r\n每日可使用点金手%|1|30%次\r\n每天重置精英关卡次数%|1|3%次\r\n竞技场冷却时间降到%|1|2%分钟\r\n包含V7及以下所有内容",
	privilege_nine = "累计充值%|1|10000%钻石即可享受该特权\r\nV9超值大礼包：%|1|巴多拉兽碎片（巴多拉兽升星必备材料）%\r\n%|1|技能点回复时间降低至5秒/点%\r\n每天可购买体力%|1|11%次\r\n每日可使用点金手%|1|35%次\r\n每天重置精英关卡次数%|1|3%次\r\n包含V8及以下所有内容",
	privilege_ten = "累计充值%|1|15000%钻石即可享受该特权\r\nV10超值大礼包：%|1|凤凰之翼（巴多拉兽专属武器）%\r\n战队等级达到75级可在数码试炼中一键跳过52层\r\n开启每日任务：%|1|送天赋点%\r\n每天可购买体力%|1|12%次\r\n每日可使用点金手%|1|40%次\r\n每天重置精英关卡次数%|1|4%次\r\n包含V9及以下所有内容",
	privilege_eleven = "累计充值%|1|20000%钻石即可享受该特权\r\nV11超值大礼包：%|1|钻石大放送%\r\n每天可购买体力%|1|13%次\r\n每日可使用点金手%|1|50%次\r\n每天重置精英关卡次数%|1|4%次\r\n包含V10及以下所有内容",
	privilege_twelve = "累计充值%|1|30000%钻石即可享受该特权\r\nV12超值大礼包：%|1|4星加鲁鲁兽（最强单体）%\r\n%|1|数码试炼积分增加15％%\r\n每天可购买体力%|1|14%次\r\n每日可使用点金手%|1|60%次\r\n每天重置精英关卡次数%|1|4%次\r\n包含V11及以下所有内容",
	privilege_thirteen = "累计充值%|1|60000%钻石即可享受该特权\r\nV13超值大礼包：%|1|D-3数码机之魂，炎系指环之魂（加鲁鲁兽觉醒神圣计划和指环）%\r\n战队等级达到75级可在数码试炼中一键跳过54层\r\n开启每日任务：%|1|送万能升星碎片%\r\n每天可购买体力%|1|15%次\r\n每日可使用点金手%|1|80%次\r\n每天重置精英关卡次数%|1|5%次\r\n竞技场冷却时间降到%|1|1%分钟\r\n包含V12及以下所有内容",
	privilege_fourteen = "累计充值%|1|120000%钻石即可享受该特权\r\nV14超值大礼包：%|1|5星加鲁鲁兽%\r\n%|1|数码试炼积分增加30％%\r\n每天可购买体力%|1|16%次\r\n每日可使用点金手%|1|100%次\r\n每天重置精英关卡次数%|1|5%次\r\n包含V13及以下所有内容",
	privilege_fifteen = "累计充值%|1|200000%钻石即可享受该特权\r\nV15超值大礼包：%|1|绝对冷冻炮（加鲁鲁兽专属武器）%\r\n每天可购买体力%|1|17%次\r\n每日可使用点金手%|1|160%次\r\n每天重置精英关卡次数%|1|5%次\r\n包含V14及以下所有内容",
	privilege_sixteen = "累计充值%|1|300000%钻石即可享受该特权\r\nV16超值大礼包：%|1|大量觉醒合金、加鲁鲁兽礼物%\r\n开启每日任务：%|1|送神器能量之魂%\r\n战队等级达到75级可在数码试炼中一键跳过56层\r\n包含V15及以下所有内容",
	privilege_seventeen = "累计充值%|1|500000%钻石即可享受该特权\r\nV17超值大礼包：%|1|16资质数码兽4选1箱子，可以选择获得目标数码兽碎片150个%（VIP17玩家且战队等级到达60级可购买）\r\n开启每日任务：%|1|送小丑皇封印箱%\r\n包含V16及以下所有内容",
	privilege_eighteen = "累计充值%|1|800000%钻石即可享受该特权\r\nV18超值大礼包：%|1|16资质数码兽觉醒武器4选1箱子%（VIP18玩家且战队等级到达60级可以购买）\r\n战队等级达到75级可在数码试炼中一键跳过58层\r\n包含V17及以下所有内容",
}


-- 分解界面说明文字
_Decompose_tip_info = "1.点击“+”进入选择界面，每次可最多选择5个数码兽、装备、宝物或时装进行分解。\r\n2.只可分解4星及以上未进化的数码兽，分解后返还所有升级花费并获得兽魂。\r\n3.可分解3星和4星装备，分解后返还所有升级花费并获得精炼书。\r\n4.可分解5星装备，分解后返还所有升级花费并获得橙装铸造材料。\r\n5.只可分解5星宝物，分解后可获得灵气精华并返还所有强化经验（返还的经验在分解获得的蓝色经验宝物中）\r\n6.分解时装可获得时装精华\r\n7.分解后，所分解的数码兽、装备、宝物或时装将会消失。"


-- 退化界面说明文字
_Regeneration_tip_info = "1.点击“+”进入选择界面，每次只可选择1个数码兽、装备、宝物或时装进行退化。\r\n2.可退化强化等级在2级及以上的4星数码兽和5星数码兽，退化后返还所有花费（进化所消耗的金币不返还），退化后的数码兽恢复进化等级为0阶，强化等级为1级。\r\n3.可退化6星数码兽，退化后变为5星+7，等级不变，并返还进化和橙色进化所消耗的所有金币及材料。\r\n4.只可退化5星且强化等级大于0的装备，退化后返还所有强化费用，并根据洗炼属性返还精炼书。\r\n5.只可退化强化等级大于0的时装，退化后返还所有强化费用和时装精华。\r\n6.只可退化4星及以上，强化过的宝物，退化后返还所有升级花费，并根据宝物等级返还经验宝物和精炼宝物\r\n7.每次退化需要花费一定钻石。"


-- 灵异探险界面的说明文字
_Divine_explain_tip_info = "1.点亮目标图案上的所有图案或点击任何图案都可以获得星数奖励。\r\n\r\n2.通过获得的星数可兑换奖励，星数越多兑换的奖励越多。\r\n\r\n3.每日凌晨0点重置探险次数、当前星数及奖励。"

-- 限时队长级说明文字
_Limited_hero_tip_info = "1.在活动界面中使用免费抽取或者钻石抽取数码兽即可获得10积分。\r\n2.每累积获得150积分，即可获得1次免费钻石抽取次数。\r\n3.每次抽取可随机获得4星或5星数码兽，5星数码兽中包含限时活动数码兽。\r\n4.活动结束时，根据积分排名，将会发放排名奖励。\r\n5.玩家每达到1000积分时必定抽中当前限时队长。\r\n6.积分达到60分的玩家将额外获得：10个金经验兽，金币20万，500个进化石（该奖励与排名奖励可同时获得）\r\n活动结束的当天内奖励即会发放，通过奖励中心领取。"

-- 超级变变变说明文字(限时兑换)
_Super_change_tip_info = "1.活动期间内，玩家可使用指定的物品进行兑换，获得新的物品；\r\n2.可使用未强化过的装备或宝物进行兑换；\r\n3.兑换后会失去原有物品并获得兑换后的新物品。"

-- 分段折扣说明文字
_Divide_sell_tip_info = "1.活动期间根据全服购买的指定道具数量对该道具进行打折。\r\n2.当指定道具消耗数量达到指定数量时，商店内出售的该道具价格也将相应的发生变化。\r\n"

-- 跨服幸运大转盘说明文字
_Luck_turntable_tip_info = "1.活动期间使用免费或钻石转动幸运大转盘都可获得1积分，活动结束后会根据积分排名发放对应奖励；\r\n2.免费次数不会累加，免费次数使用后12小时会恢复；\r\n3.活动期间使用免费或钻石转动幸运大转盘都会增加一点次数奖励进度条，达到对应次数可立刻领取奖励；\r\n4.每天有5次免费刷新机会可刷新转盘上的奖励，免费次数用完后可使用钻石刷新，当玩家抽中高级道具时会强制刷新转盘；\r\n5.免费刷新或使用钻石刷新都有机会刷出高级限量道具（限量道具售光后无法再刷出）；\r\n6.免费转动或使用钻石转动幸运大转盘都有机会获得幸运大奖；\r\n7.系统会将玩家转动转盘消耗的钻石按一定比例累加到幸运大奖奖池，累加无上限；\r\n8.当玩家转到幸运大奖后，将会独得奖池内一定比例的钻石大奖；\r\n9.幸运大转盘数据所有服务器互通。"

-- 灵王宫说明文字
_spirite_palace_tip_info = "1.每天可获得一次免费重置机会（不可累加）；\r\n2.灵王宫共有五层，每层达到可移动次数上限后就出现下一层入口，达到第五层终点即完成本轮探险；\r\n3.点击岔道口的事件图标可以查看事件说明，点击移动可触发该事件，或直接点击下方箭头进行移动；\r\n4.每触发一个事件都会获得一定的积分，积分可在灵王宫商店兑换道具；\r\n5.每次移动都会消耗1点行动力，行动力为0时不可再移动；\r\n6.首次进入灵王宫或重置后，会根据玩家当前阵容确定当前探险阵型，探险阵型一旦确定，本次探险过程中将无法进行改变；\r\n7.首次进入灵王宫或重置后，会根据玩家当前阵容所有数码兽生命之和的三倍生成一条血槽，玩家在探险过程中会遭遇战斗，战斗结束后会根据数码兽的损血量消耗血槽进行补充，如果血槽降到0便无法继续探险。"

-- 跨服战说明文字
_cross_server_tip_info = "【更新战斗信息】\r\nA）战斗信息\r\n是指跟玩家战斗相关的数据，即上阵数码兽、装备、鬼道、阵型等所有可以影响玩家战斗强弱的相关信息。\r\nB）更新战斗信息\r\n玩家每次变动战斗信息后需要点击“更新战斗信息”来向跨界争霸战游戏服务器上传最新的战斗信息，否则游戏服务器上的玩家战斗信息不会改变。\r\n【跨界争霸战规则】\r\nA）先手规则\r\n战斗力高的玩家为先手\r\nB）海选赛规则\r\n1、瀞灵廷组海选赛规则\r\n1）随机分配对手，每场1局，每场间隔10分钟\r\n2）玩家不会再遇到已出局的对手\r\n3）如果玩家累积失败3场则被淘汰出局，直至决出最后32强\r\n4）玩家可以在我的信息中“我的战绩”处查看自己的战绩\r\n2、流魂街组海选赛规则\r\n1）瀞灵廷组海选赛结束后，去除瀞灵廷组出线的选手，其他玩家进行流魂街组海选赛\r\n2）随机分配对手，每场1局，每场间隔10分钟\r\n3）玩家不会再遇到已出局的对手\r\n4）如果玩家累积失败3场则被淘汰出局，直至决出最后32强，海选结束\r\n5）玩家可以在我的信息中“我的战绩”处查看自己的战绩\r\nC）晋级赛规则\r\n1、海选赛出线的瀞灵廷32强和流魂街32强分成16组，以每组2人进行5局3胜的比赛，获得3场胜利的玩家晋级，每局间隔20分钟\r\n2、每场晋级赛间隔1天\r\n3、瀞灵廷组和流魂街组分别决出各自组的冠军\r\n4、进入晋级赛的玩家自动进入跨服跨界争霸赛的海选\r\n【跨服跨界争霸赛规则】\r\nA）先手规则\r\n战斗力高的玩家为先手\r\nB）海选赛规则\r\n1、瀞灵廷组海选赛规则\r\n1）随机分配对手，每场1局，每场间隔10分钟\r\n2）玩家不会再遇到已出局的对手\r\n3）如果玩家累积失败3场则被淘汰出局，直至决出最后32强\r\n4）玩家可以在我的信息中“我的战绩”处查看自己的战绩\r\n2、流魂街组海选赛规则\r\n1）瀞灵廷组海选赛结束后，去除瀞灵廷组出线的选手，其他玩家进行流魂街组海选赛\r\n2）随机分配对手，每场1局，每场间隔10分钟\r\n3）玩家不会再遇到已出局的对手\r\n4）如果玩家累积失败3场则被淘汰出局，直至决出最后32强，海选结束\r\n5）玩家可以在我的信息中“我的战绩”处查看自己的战绩\r\nC）晋级赛规则\r\n1、海选赛出线的瀞灵廷32强和流魂街32强分成16组，以每组2人进行5局3胜的比赛，获得3场胜利的玩家晋级，每局间隔20分钟\r\n2、每场晋级赛间隔1天\r\n3、瀞灵廷组和流魂街组分别决出各自组的冠军\r\n4、跨服跨界争霸赛瀞灵廷组冠军所在服务器所有玩家可获得礼包奖励\r\n【助威规则】\r\n晋级赛阶段，每场晋级赛玩家只可为1名玩家助威，被助威的玩家如果进入下一轮比赛，则助威的玩家可获得助威奖励。每场晋级赛结束后发放助威奖励，当奖励发放完毕后，可进行下一场晋级赛的助威。"

-- 副队长说明文字
_vice_captain_tip_info = "1.上阵中的副队长，每隔一段时间获得一定经验；\r\n2.只有上阵中的副队长才可进行出战操作，出战的副队长可在战前将自身技能属性提供给上阵数码兽；\r\n3.一次只能出战一名副队长；\r\n4.培养可增加副队长经验，当副队长升到一定等级时可获得技能点；\r\n5.技能点可用来开启技能槽、领悟技能、升级技能。"

--侵略者帮助奖励文字
_betray_army_reward_tip_info = "1.光丘守护可获得功勋奖励，主要是大量金币、芯片石和橙色经验宝物。\r\n2.光丘守护还可获得战功，战功可在战功商店购买稀有数码兽和芯片石。"

--侵略者帮助功勋文字
_betray_army_exploit_tip_info = "1.35级后，每次挑战主线副本和精英副本都有概率发现侵略者，可以单独或邀请好友一起光丘守护。\r\n2.每次光丘守护会获得功勋值，伤害越高功勋值越多，数码兽每进化+1对侵略者伤害提升2.5倍！\r\n3.若击杀侵略者，发现侵略者的玩家和给予最后一击的玩家都可获得钻石奖励。"

--侵略者帮助战功文字
_betray_army_credit_tip_info = "1.攻打侵略者时，每消耗一个挑战书，都可获得50战功。\r\n2.若进入光丘守护的每日功勋榜和每日伤害榜前200名，还可获得额外的排名战功奖励。\r\n3.每天12:00-14:00怒攻只消耗1个挑战书，18:00-20:00攻打侵略者功勋翻倍。"

--公会资源抢夺帮助信息
_capture_resource_tip_info = "1.击败建筑守卫者可占领该建筑，并可获得资源产出奖励；\r\n2.每名玩家可同时占领多个建筑，相邻的建筑可获得资源产出加成；\r\n3.每个建筑有对应的占领条件，占领建筑的阵容为临时组建阵容，跟原有阵容相互独立；\r\n4.可派出原阵容中已上阵的数码兽，不会计算装备和宝物属性，缘分会按照新的上阵情况重新计算；\r\n5.占领成功后，所派出的数码兽将成为建筑守卫，不可中途更换；\r\n6.攻打建筑或占领建筑可获得积分，每周二和每周五中午12点会根据积分排名发放奖励，并清空积分；\r\n7.攻打建筑无论胜利失败可获得5积分，占领建筑后每分钟可获得1积分（占领结束时根据占领时间获得）；\r\n8.排名奖励需要玩家自行进入奖励页面领取，奖励会保存到下一次排行结算，结算时会删除未领取的奖励（积分为0的玩家无法获得奖励）。"

---公会战帮助信息
_union_fight_tip_info = "报名阶段：\r\n1.周三3点开启报名；\r\n2.加入公会48小时的成员才能参与公会战；\r\n3.公会战为跨服战斗，会根据公会战力匹配对手。\r\n\r\n准备阶段：\r\n1.周四3点开启准备阶段；\r\n2.盟主和副盟主可部署防守阵型；\r\n3.公会成员在前后城各拥有一个防守格；\r\n4.暗格在被攻击前处于信息不明状态。\r\n\r\n战斗阶段：\r\n1.周五3点开启战斗，22点结算战斗；\r\n2.每人3次尝试进攻机会，2次击杀次数；\r\n3.守卫为1的据点进入【失守】状态，可被通过；\r\n4.守卫为0的据点进入【攻陷】状态，可取得积分；\r\n5.特殊据点包含额外奖励，攻陷该据点后可领取；\r\n6.结算时积分高的公会获胜，如果积分相同，战力低的公会获胜；\r\n7.胜利或失败的公会都会获得奖励，失败的奖励是胜利的一半。"


_emailTypeAllTip = {			--记录邮件的类型
	"竞技场被击败排名下降",
	"竞技场成功防守",
	"竞技场排名奖励",
	"竞技场幸运排名奖励",
	"决斗被击败",
	"决斗排名奖励",
	-- "抢夺",
	-- "竞技场被击败排名不变",
	-- "好友申请",
	"好友已同意",
	"好友已拒绝",
	-- "好友断绝",
	-- "好友留言",
	-- "好友被通过",
	-- "好友被拒绝",
	-- "充值成功",
	-- "VIP",
	"公会已通过",
	"公会被拒绝",
	"被公会踢出",
	-- "竞技场排名奖励",
	-- "竞技场幸运排名奖励",
	-- "决斗排名奖励",
	"竞技场被击败排名不变",
	"资源矿到期",
	"资源矿协助",
	"资源矿抢夺",
	"",
	"资源矿抢夺失败",
	"资源矿抢夺成功",
	"资源矿防守成功",
	"资源矿防守失败",
	"资源矿到期",
}

_emailTypeFriendTip = {		
	"好友申请",
	"好友已同意",
	"好友已拒绝",
	"好友断绝",
	"好友留言",
	"好友被通过",
	"好友被拒绝",
}

_emailTypeFightTip = {		
	"竞技场被击败排名下降",
	"竞技场成功防守",
	--"竞技场排名奖励",
	--"竞技场幸运排名奖励",
	"决斗被击败",
	--"决斗排名奖励",
	"抢夺",
	"竞技场被击败排名不变",
}

_emailTypeSystemTip = {
	"充值成功",
	"VIP",
	"公会已通过",
	"公会被拒绝",
	"被公会踢出",
	"竞技场排名奖励",
	"竞技场幸运排名奖励",
	"决斗排名奖励",
}
		
_emailTimeDraw = {
	"今天",
	"一天前",
	"两天前",
	"三天前",
	"四天前",
	"五天前",
	"六天前",
	"七天前",
	"八天前",
	"九天前",
	"十天前",
	"十一天前",
	"十二天前",
	"十三天前",
	"十四天前",
}

-- 游戏中功能未开启的提示信息
_function_unopened_tip_string = "功能暂未开启"
_unopened_tip = "未开启"
_opened_tip = "开启"
_wait_open_tip = "即将开放"

--向性, 0无,1魏,2蜀,3吴,4群
heroCamp = {
	"无",
	"疫苗",
	"数据",
	"病毒",
	"其他",
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
string_equiprety_name = {
	"生 命:",--0（固定值）
	"攻 击:",--1（固定值）
	"防 御:",--2（固定值）
	"魔防+",--3（固定值）
	"生 命:",--4 百分比
	"攻 击:",--5 百分比
	"防 御:",--6 百分比
	"魔防+",--7 百分比
	"暴击率+",--8 百分比
	"抗暴率+",--9 百分比
	"格挡率+",--10 百分比
	"破击率+",--11 百分比
	"命中率+",--12 百分比
	"闪避率+",--13 百分比
	"物理免伤+",--14 百分比
	"魔法免伤+",--15 百分比
	"治疗率+",--16 百分比
	"被治疗率",--17 百分比
	"最终伤害+",--18（固定值）
	"最终减伤+",--19（固定值）
	"初始怒气+",--20（固定值）
	"耐久+",--21（固定值）
	"火力+",--22（固定值）
	"速度+",--23（固定值）
	"物理攻击+",--24（固定值）
	"魔法攻击+",--25（固定值）
	"治疗值+",--26（固定值）
	"被治疗值+",--27（固定值）
	"燃烧伤害+",--28（固定值）
	"中毒伤害+",--29（固定值）
	"燃烧免伤+",--30（固定值）
	"中毒免伤+",--31（固定值）
	"经验+",--32（固定值）
	"最终伤害+",--33 百分比		
	"最终减伤+",--34 百分比	
	"最终减伤+",--35 百分比
	"%",--36 百分比
	"万",--37
	"亿",--38 
	"K",--39 -----资源缩写单位
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
string_equiprety_name_teo = {
	"生命",--0（固定值）
	"攻击",--1（固定值）
	"物防",--2（固定值）
	"魔防",--3（固定值）
	"生命",--4 百分比
	"攻击",--5 百分比
	"物防",--6 百分比
	"魔防",--7 百分比
	"暴击率",--8 百分比
	"抗暴率",--9 百分比
	"格挡率",--10 百分比
	"破击率",--11 百分比
	"命中率",--12 百分比
	"闪避率",--13 百分比
	"物理免伤",--14 百分比
	"魔法免伤",--15 百分比
	"治疗率",--16 百分比
	"被治疗率",--17 百分比
	"最终伤害",--18（固定值）
	"最终减伤",--19（固定值）
	"初始怒气",--20（固定值）
	"耐久",--21（固定值）
	"火力",--22（固定值）
	"速度",--23（固定值）
	"物理攻击",--24（固定值）
	"魔法攻击",--25（固定值）
	"治疗值",--26（固定值）
	"被治疗值",--27（固定值）
	"燃烧伤害",--28（固定值）
	"中毒伤害",--29（固定值）
	"燃烧免伤",--30（固定值）
	"中毒免伤",--31（固定值）
	"经验",--32（固定值）
	"最终伤害",--33 百分比		
	"最终减伤",--34 百分比	
	"最终减伤",--35 百分比
	"%",--36 百分比
	"万",--37
	"亿",--38 
}

--三国志属性加成:模板表中属性索引id是从0开始的,所以取值时记得索引id+1
--用于附加在取值后面,是显示固定值还是百分比
string_equiprety_name_vlua_type = {
	"",--0（固定值）
	"",--1（固定值）
	"",--2（固定值）
	"",--3（固定值）
	"%",--4 百分比
	"%",--5 百分比
	"%",--6 百分比
	"%",--7 百分比
	"%",--8 百分比
	"%",--9 百分比
	"%",--10 百分比
	"%",--11 百分比
	"%",--12 百分比
	"%",--13 百分比
	"%",--14 百分比
	"%",--15 百分比
	"%",--16 百分比
	"%",--17 百分比
	"",--18（固定值）
	"",--19（固定值）
	"",--20（固定值）
	"",--21（固定值）
	"",--22（固定值）
	"",--23（固定值）
	"",--24（固定值）
	"",--25（固定值）
	"",--26（固定值）
	"",--27（固定值）
	"",--28（固定值）
	"",--29（固定值）
	"",--30（固定值）
	"",--31（固定值）
	"",--32（固定值）
	"%",--33 百分比		
	"%",--34 百分比	
	"%",--35 百分比
	"",--36 百分比
	"",--37
	"",--38 
}

-- 宝物属性类型定义
_influence_type = {
	"生命",--0（固定值）		
	"攻击",--1（固定值）		
	"物防",--2（固定值）		
	"魔防",--3（固定值）		
	"生命",--4 百分比		
	"攻击",--5 百分比		
	"物防",--6 百分比		
	"魔防",--7 百分比		
	"暴击率",--8 百分比		
	"抗暴率",--9 百分比		
	"格挡率",--10 百分比		
	"破击率",--11 百分比		
	"命中率",--12 百分比		
	"闪避率",--13 百分比		
	"物理免伤",--14 百分比		
	"魔法免伤",--15 百分比		
	"治疗率",--16 百分比		
	"被治疗率",--17 百分比		
	"最终伤害",--18（固定值）		
	"最终减伤",--19（固定值）		
	"初始怒气",--20（固定值）		
	"体质",--21（固定值）		
	"力量",--22（固定值）		
	"灵力",--23（固定值）		
	"物理攻击",--24（固定值）		
	"魔法攻击",--25（固定值）		
	"治疗值",--26（固定值）		
	"被治疗值",--27（固定值）		
	"燃烧伤害",--28（固定值）		
	"中毒伤害",--29（固定值）		
	"燃烧免伤",--30（固定值）		
	"中毒免伤",--31（固定值）		
	"经验",--32（固定值）		
	"最终伤害",--33 百分比		
	"最终减伤",--34 百分比
	"PVP增伤",--35 百分比		
	"PVP减伤",--36 百分比
	"怒气恢复",--37 （固定值）
}

--奖励物品类型
reward_prop_list = {
	"金币",
	"钻石",
	"竞技币",
	"数码魂",
	"天赋点",
	"道具",
	"装备",
	"战队经验",
	"精力",
	"功能点",
	"上阵数",
	"体力",
	"数码兽",
}

_reward_icon_name = {
	"icon_gold",------------金币
	"icon_gem",------------钻石
	"",------------声望
	"",------------将魂（无用）
	"icon_jianghun",------------兽魂
	"",------------道具
	"",------------装备
	"ext",------------经验
	"icon_immo",------------精力
	"",----------功能点
	"",--------上阵数
	"icon_power",------------体力
	"",------------数码兽
}

_equiprety_name = {
	"生命",
	"攻击",
	"物防",
	"魔防",
	"生命",
	"攻击",
	"物防",
	"魔防",
	"暴击",
	"抗暴",
	"格挡",
	"破击",
	"命中",
	"闪避",
	"物理免伤",
	"魔法免伤",
	"被治疗率",
}

_property = {
	"生命",
	"攻击",
	"物防",
	"魔防",
	"耐久",
	"火力",
	"速度",
}

----

--包裹已满的提示
_pack_fill_tip = {
	propPackTip = "您的道具仓库已满",
	treasurePackTip = "您的宝物仓库已满",
	equipPackTip = "您的装备仓库已满,请先清理一下吧!",
	equipFragmentPackTip = "您的装备碎片仓库已满",
	heroPackTip = "您的数码兽仓库已满,请先清理一下吧!",
	fashionPackTip = "您的时装仓库已满",
	ghostPackTip = "您的鬼道仓库已满",
	viceCaptainPackTip = "您的副队长仓库已满",
}

-- 字符串拼接数组  -- FLAG!!!!
_string_piece_info = {
	"请选择服务器", --------------------------------------------1
	"第",		   	--------------------------------------------2
	"关",			--------------------------------------------3
	"数量",			--------------------------------------------4
	"装备于",		--------------------------------------------5
	"级",			--------------------------------------------6
	"武器",			--------------------------------------------7
	"腰带",			--------------------------------------------8
	"头盔",			--------------------------------------------9
	"铠甲",			--------------------------------------------10
	"装备中",		--------------------------------------------11
	"数量不足",		--------------------------------------------12
	"本次抽中橙色数码兽概率X",------------------------------------13
	"倍",-------------------------------------------------------14
	"首次抽取必得紫色数码兽",-------------------------------------15
	"等级",-----------------------------------------------------16
	"价格",-----------------------------------------------------17
	"达到VIP4可跳过精英副本战斗",-------------------------------18
	"需要通过该关卡后才能跳过！",-------------------------------19
	"达到VIP4可跳过经验宝物副本战斗",---------------------------20
	"达到VIP4可跳过金经验兽副本战斗",---------------------------21
	"5级可使用战斗加速",----------------------------------------22
	"5级可使用战斗加速",----------------------------------------23
	"请选择需要出售的装备",-------------------------------------24
	"您已经选择出售",-------------------------------------------25
	"个装备",---------------------------------------------------26
	"总计出售可获得",-------------------------------------------27
	"金币",-----------------------------------------------------28
	"进化", 	------------------------------------------------29	
	"强化等级达到上限", 	------------------------------------30	
	"件效果", 	------------------------------------------------31
	"个", 	----------------------------------------------------32
	"数码兽",-----------------------------------------------------33
	"未上榜",---------------------------------------------------34	
	"点击+选择材料数码兽才能升级哦！",----------------------------35	
	"您当前没有蓝色以下品质的数码兽或经验数码兽，无法添加",---------36
	"缘分",-----------------------------------------------------37
	"天赋",-----------------------------------------------------38
	"数码兽说明",-------------------------------------------------39
	"进化+",----------------------------------------------------40
	"级解锁",---------------------------------------------------41
	"强化+",----------------------------------------------------42
	"技能",-----------------------------------------------------43
	"资质",-----------------------------------------------------44
	"精炼",-----------------------------------------------------45
	"阶",-------------------------------------------------------46
	"可激活缘分+1",---------------------------------------------47
	"2件效果",--------------------------------------------------48
	"3件效果",--------------------------------------------------49
	"4件效果",--------------------------------------------------50
	"进化",-----------------------------------------------------51
	"激活",-----------------------------------------------------52
	"每次只能选择五个数码兽",-------------------------------------53
	"30级才开放装备精炼,请提升等级再来吧!",----------------54
	"出售所选的",-----------------------------------------------55
	"个宝物，获得",---------------------------------------------56
	"金币，您确定要出售吗？",-----------------------------------57
	"疫苗种",---------------------------------------------------58
	"数据种",---------------------------------------------------59
	"病毒种",---------------------------------------------------60
	"其他",---------------------------------------------------61
	"此数码兽已达到等级上限",-------------------------------62
	"碎片",-----------------------------------------------------63
	"数码兽",-----------------------------------------------------64
	"缘分",-----------------------------------------------------65
	"组合技",-----------------------------------------------------66
	"可激活缘分+",----------------------------------------------67
	"LV:",------------------------------------------------------68
	"今日可买",-------------------------------------------------69
	"次",-------------------------------------------------------70
	"已达购买上限",---------------------------------------------71
	"普通招募书不足",-----------------------------------------------72
	"大型开发书不足",-----------------------------------------------73
	"钻石不足",-------------------------------------------------74
	"无购买上限",-----------------------------------------------75
	"购买成功",-------------------------------------------------76
	"购买价格每日0点刷新",--------------------------------------77
	"该数码兽进化次数已达上限！",---------------------------------78
	"需要等级到达",---------------------------------------------79
	"进化所需数码兽不足",-----------------------------------------80
	"进化所需道具不足",-----------------------------------------81
	"进化所需装备不足",-----------------------------------------82
	"需要达到VIP%d及以上可购买",----------------------------------------------83
	"请选择人物",-----------------------------------------------84
	"道具数量不足",---------------------------------------------85
	"金币不足",---------------------------------------------86
	"您当前没有任何品质小于橙色的数码兽！",-----------------87
	"请先选择你要分解的",---------------------------------88
	"没有可退化的",---------------------------------------------89
	"数码兽已满级",-----------------------------------------------90
	"进化已达上限",---------------------------------------------91
	"进化成功",-------------------------------------------------92
	"出售成功,共获金币",----------------------------------------93
	"你当前没有符合条件的装备！",-------------------------94
	"每次只能选择五个装备",-------------------------------------95
	"防御",-----------------------------------------------------96
	"第",-------------------------------------------------------97
	"章",-----------------------------------------------------98
	"资源更新失败，是否重新更新？",-------------99
	"网络不给力哟~请重新连接~！",-----------------100
	"您将要更新",-----------------------------------------101
	"的资源，您现在要更新么？选择不更新将会退出游戏。",---------102
	"30级开启",-------------------------------------------------103
	"等级不足",-------------------------------------------------104
	"已通关",---------------------------------------------------105
	"完美通关",-------------------------------------------------106
	"更新完毕",-------------------------------------------------107
	"你没有绿、蓝品质的装备可选择",--------------------108
	"暂无可出售装备",-------------------------------------------109
	"您没有任何该品质的装备",------------------------------110
	"您没有任何该品质的数码兽",------------------------------111
	"暂无可出售数码兽",-------------------------------------------112
	"今日挑战次数已经用完",-------------------------------------113
	"你没有白、绿、蓝品质的数码兽可选择",--------------------114
	"援军",-----------------------------------------------------115
	"已上阵",---------------------------------------------------116
	"昵称不能超过6个字符！",-------------------------------117
	"主角昵称不可为空！",---------------------------------------118
	"昵称中不可包含特殊字符！",---------------------------------119
	"主线副本",-------------------------------------------------120
	"无限山",-------------------------------------------------121
	"商城-橙色箱子",--------------------------------------------122
	"[主线副本]掉落",------------------------------------123
	"可以在神秘商店购得",---------------------------------------124
	"有几率开出装备碎片",---------------------------------------125
	"培养液不足",-----------------------------------------------126
	"金币不足",-------------------------------------------------127
	"钻石不足",-------------------------------------------------128
	"VIP5级开放培养十次，当前VIP等级不足，充值可提升VIP等级",---129
	"VIP4级开放培养五次，当前VIP等级不足，充值可提升VIP等级",---130
	"已刷新",---------------------------------------------------131
	"光丘守护",-------------------------------------------------132
	"未解锁",---------------------------------------------------133
	"经验",-----------------------------------------------------134
	"日常副本",-------------------------------------------------135
	"邮件",-----------------------------------------------------136
	"好友界面",-------------------------------------------------137
	"日常任务",-------------------------------------------------138
	"大师榜",---------------------------------------------------139
	"内容",-----------------------------------------------------140
	"解锁天赋: ",-----------------------------------------------141
	"培养一次",-------------------------------------------------142
	"培养五次",-------------------------------------------------143
	"培养十次",-------------------------------------------------144
	"点击选择",-------------------------------------------------145
	"玩家详细信息及操作",---------------------------------------146
	"公会商店",-------------------------------------------------147
	"恭喜你获得",-----------------------------------------------148
	"道具使用成功！",-------------------------------------------149
	"万",-------------------------------------------------------150
	"未上榜",---------------------------------------------------151
	"X",--------------------------------------------------------152
	"+",--------------------------------------------------------153
	"恭喜你开启功能点",-----------------------------------------154
	"恭喜你的上阵数提高",-------------------------------------155
	"点",-------------------------------------------------------156
	"已达到购买上限",-------------------------------------------157
	"竞技场",---------------------------------------------------158
	"名可购买",-------------------------------------------------159
	"可购买",---------------------------------------------------160
	"刷新次数上限",---------------------------------------------161
	"强化等级+",------------------------------------------------162
	"强化暴击",-------------------------------------------------163
	"冷却时间",-------------------------------------------------164
	"秒",-------------------------------------------------------165
	"没有蓝色品质以下的宝物了",---------------------------------166
	"阵容查看",-------------------------------------------------167
	"暂无可出售宝物",-------------------------------------------168
	"你没有蓝、紫品质的宝物可选择",--------------------169
	"您没有任何该品质的宝物",------------------------------170
	"请选择你要出售的宝物",--------------------------------171
	"今日可买",-------------------------------------------------172
	"次",-------------------------------------------------------173
	"一星",-----------------------------------------------------174
	"二星",-----------------------------------------------------175
	"三星",-----------------------------------------------------176
	"(无数码兽阵亡)",---------------------------------------------177
	"(1数码兽阵亡)",----------------------------------------------178
	"(多于1数码兽阵亡)",------------------------------------------179
	"获得%s颗星星后可获取哟!",----------------------------------180
	"您已经领取该宝箱啦!",--------------------------------------181
	"级开启",---------------------------------------------------182
	"获得《",---------------------------------------------------183
	"》X",--------------------------------------------------184
	"竞技场奖励",-----------------------------------------------185
	"恭喜您在竞技场中位列",-------------------------------------186
	"名，鉴于神勇表现，特发以上".."\r\n".."奖励。",-------------------------187
	"奖励发放",-------------------------------------------------188
	"VIP宝箱",--------------------------------------------------189
	"竞技场幸运奖励",-------------------------------------------190
	"(与",------------------------------------------------------191
	"达成合击)",------------------------------------------------192
	"精练成功",-------------------------------------------------193
	"提升一阶",-------------------------------------------------194
	"今日已聚宝",-----------------------------------------------195
	"采集篓累积了",---------------------------------------196
	"金币啦，再聚宝",---------------------------------------197
	"次即可领取奖励",----------------------------------------198
	"暂未开放",-------------------------------------------------199
	"可激活合击技",---------------------------------------------200
	"美食已经准".."\r\n".."备好了，快请享用吧~",----------201
	"今天的美食".."\r\n".."已吃完，还请明日".."\r\n".."再来~",--202
	"美食酱正在".."\r\n".."努力，晚点再来".."\r\n".."吧~",--203
	"充值送礼",-------------------------------------------------204【数码宝贝】活动
	"活动时间内，完成对应目标就可以获得奖励！",--------------------------------------205【数码宝贝】活动
	"充值",-----------------------------------------206【数码宝贝】活动
	"钻石",-------------------------------------------------------207
	"点击".."+".."号,选择素材进行宝物强化吧",-------------------------208
	"累计消费",----------------------------------------------------209
	"活动时间内，累计消费达到指定金额就可以获得奖励！",------------------------------210【数码宝贝】活动
	"累计消耗",----------------------------------------------------211【数码宝贝】活动
	"体力回复了",----------------------------------------------------212
	"5级可使用战斗加速",---------------------------213
	"5级可使用战斗加速",---------------------------214
	"每日充值",----------------------------------------------------215
	"钻石以上！即可领取豪华奖励",---------------------------216
	"元",----------------------------------------------------217
	"首次充值额外赠送",----------------------------------------------------218
	"钻石".."\r\n".."(限购1次)",----------------------------------------------------219
	"充值额外赠送",----------------------------------------------------220
	"首充成功，恭喜获得",----------------------------------------------------221
	"钻石！",----------------------------------------------------222
	"立即获得",----------------------------------------------------223
	"钻石，连续",--------------------------------------------------224
	"\r\n".."天每天可领取",------------------------------------------------225
	"没有可退化的宝物",------------------------------------------------226
	"没有可退化的数码兽",------------------------------------------------227
	"VIP",------------------------------------------------228
	"每天可领取",------------------------------------------------229
	"钻石，剩余".."\r\n",------------------------------------------------230
	"天",------------------------------------------------231
	"领取月卡每日奖励成功，恭喜获得",------------------------------------------------232
	"剩余可领取时间：",------------------------------------------------233
	"数码兽分解后将会获得以下物品",------------------------------------------------234
	"装备分解后将会获得以下物品",------------------------------------------------235
	"数码兽退化后将会获得以下物品",------------------------------------------------236
	"宝物退化后将会获得以下物品",------------------------------------------------237
	"VIP等级已达上限",------------------------------------------------238
	"恭喜购买",------------------------------------------------239
	"月卡成功！每日都可以领取免费钻石哟!",------------------------------------------------240
	"使用成功！体力补充完毕，快去【出击】吧！",------------------------------------------------241
	"40级才开放宝物精炼,请提升等级再来吧!",----------------242
	"钻石，并额外获得的",----------------243
	"钻石！",----------------244
	"充值成功，恭喜获得",----------------245
	"钻石，快继续闯关吧！",----------------246
	"领取月卡每日奖励成功，剩".."\r\n".."余",----------------247
	"是否花费",----------------248
	"重置副本",----------------249
	"今日还可重置",----------------250
	"次",----------------251
	"今日重置次数已用完",----------------252
	"今日挑战次数已用完",----------------253
	"芯片值",----------------254
	"荣誉不足",----------------255
	"~~~目前什么都没有哟~~~",----------------256
	"您还没有输入任何文字",----------------257
	"你要和自己聊天吗",----------------258
	"已申请添加",----------------259
	"为好友",----------------260
	"已添加",----------------261
	"到黑名单",----------------262
	"已经在你的黑名单了",----------------263
	"确定将",----------------264
	"拉入黑名单?拉入黑名单后,你将无法收到对方的聊天信息",----------------265
	"夺宝",----------------266
	"积分",----------------267
	"在线",----------------268
	"离线",----------------269
	"分钟",----------------270
	"小时",----------------271
	"周以上",----------------272
	"当前钻石不足，是否前往充值",----------------273
	"当前VIP等级不足，是否前往充值",----------------274
	"是否与",----------------275
	"绝交,你们的友谊真的走到尽头了吗?",----------------276
	"是否花费200钻石购买等级基金？",----------------277【数码宝贝】等级基金
	"需要达到VIP3才能购买哦~",----------------278【数码宝贝】等级基金
	"成功购买等级基金，快去练级领奖励吧~",----------------279【数码宝贝】等级基金
	"名字不能为空",----------------280
	"已有%s人购买啦~",----------------281
	"购买人数到达",----------------282
	"即可领取",----------------283
	"等级到达",----------------284
	"采集箱已经空空如也，明日继续采集吧!",----------------285
	"采集箱已经吃撑了！快领取里面的金币吧！",----------------286
	"快来挑战无限山吧！",----------------287
	"小时前",----------------288
	"分钟前",----------------289
	"刚刚",----------------290
	"天前",----------------291
	"夺宝信息",----------------292
	"疫苗进度",----------------293
	"数据进度",----------------294
	"病毒进度",----------------295
	"其他进度",----------------296
	"经验数码兽不可以强化",----------297
	"经验数码兽不可以精炼",----------298
	"40级开启",----------299
	"不可强化",----------300
	"不可精炼",----------301
	"活动未开启",----------302
	"战力",----------303
	"请选择一个奖励类型",----------304
	"已结束",----------305
	"仅限前%s人购买（剩余%s件）",----------306
	"冷却时间",----------307
	"秒",----------308
	"发送成功",----------309
	"无",----------310
	"使用成功！出击次数增加",----------311
	"挑战书数量不足，请先购买",----------312
	"留言成功",----------313
	"昵称不能超过六个字",----------314
	"请输入您的昵称哟~",----------315
	"当前钻石不足，是否前往充值？",----------316
	"名",----------317
	" 今日点赞次数已经用完,请明日再来吧",----------318
	"该玩家很懒，什么都没有留下",----------319
	"今日功勋达到",----------320
	"可以领取",----------321
	"达到VIP",----------322
	"后开启",----------323
	"暂无",----------324
	"没有可领取的体力",----------325
	"今日领取次数已用完",----------326
	"需要通过该关卡才能进行扫荡",----------327
	"需要达到3星才能扫荡",----------328
	"15级才开放夺宝，请努力提升等级再来吧！",----------329
	"第",----------330
	"名",----------331
	"战功x",----------332
	"的缘分",----------333
	"激活",----------334
	"侵略者已被击杀",----------335
	"好友%s造成x%d伤害",----------336
	"发现",----------337
	"，是否前往攻打？",----------338
	"强化成功!,宝物经验增加",----------339
	"成功升到",----------340
	"请输入昵称:",----------341
	"请输入信息:",----------342
	"5级才能穿戴装备,请努力提升等级再来吧！",----------343
	"已满级",----------344
	"此数码兽已经满级,不需要再升级了!",----------345
	"不能进化",----------346
	"不可跃迁",----------347
	"培养属性已满,请提升数码兽等级可提高培养属性上限",----------348
	"已满值",----------349
	"请选择需要出售的数码兽",----------350
	"恭喜获得",----------351
	"达到VIP%d才可购买，充值可提升VIP等级",----------352
	"竞技币不足",----------------353
	"成功领取1点精力",------------354
	"还在为基础资源烦恼吗？限时兑换强势来袭，各种福利爽翻天！",------------355
	"是否确定购买VIP%s礼包？",------------356
	"光丘守护奖励",------------357
	"扫荡",------------358
	"（每次消耗%d点体力）",------------359
	"通关 %s 开启",---------------------360
	"每天只能挑战%d次！",---------------------361
	"这是为您精心准备的奖励，还望笑纳！", ------------------362,
	"服务器维护中,请稍后重试!",---------------------------363
	"点赞成功,并获得%d金币!",---------------------------364
	"暂未开放获得途径",------------------365
	"与%s合击",---------------------------------------------366
	"剩余次数",---------------------------------------------367
	"土豪，求抱大腿~~~！",----------368
	"材料经验已超出等级上限，是否继续升级？",----------369
	"和",----------370
	",",----------371
	"可购买%d次",------------372
	"要邀请好友一起光丘守护吗？",------------373
	"昵称不可为空",----------374
	"您还没有输入任何信息",----------375
	"努力加载中，耐心等待",------------------376
	"叛军发现",-------377 不要替换此文字，前端根据此文字替换成 379的文字
	"叛军击杀",-------378 不要替换此文字，前端根据此文字替换成 380的文字
	"发现侵略者",-------379 用于377的转换
	"击杀侵略者",-------380 用于378的转换
	"芯片已达上限",-------381
	"经验宝物无法强化和精炼！",--------382
	"主角无法使用此方式升级！",--------383
	"该数码兽无法进化！",----------------384
	"您选择了高品质数码兽，确认消耗？",----------------385
	"您选择了高品质宝物，确认消耗？",----------------386
	"是否花费%d钻石购买？",----------------------------387
	"是否花费%d钻石学习技能？",----------------------------388
	"是否花费%d钻石学习十次？",----------------------------389
	"达到%d级可以领取",----------------------------390
	"上阵数码兽数量不可超过%s人",----------------------------391
	"上阵数码兽等级不可超过%s级",----------------------------392
	"上阵数码兽品质不可低于%s品质",----------------------------393
	"%d小时收益%d%s",----------------------------394
	"请先上阵数码兽",----------------------------395
	"确定放弃占领？放弃可收获%d%s\n\r(可前往奖励中心领取)",----------------------------396
	"急报！您的地盘被人抢去了！",----------------------------397 地盘被抢夺
	"您有地盘占领时间已满",----------------------------398 地盘到期
	"恭喜您成功抢占到一个地盘",----------------------------399 
	"很遗憾，地盘未抢占成功",----------------------------400 
	"恭喜您成功延长占领时间",----------------------------401 
	"资源抢夺奖励",------------402
	"(可前往奖励中心领取)",------------403
	"该数码兽正在驻守中，无法提升等级",------------404
	"扩充次数已达上限",------------405
	"是否花费%d钻石扩充1个占领上限？",------------406
	"购买成功，占领上限+1",------------407
	"积分奖励",------------408
	"每小时产出%s%s",------------409
	"可占领4小时",------------410
	"很遗憾，暂时未搜索到对应的空建筑",------------------411
	"请输入坐标X:",----------412
	"请输入坐标Y:",----------413
	"请输入地图索引:",----------414
	"搜索地图超过最大上限",------------------415
	"搜索坐标超出最大区域",------------------416
	"输入地图信息错误",------------------417
	"输入X坐标信息错误",------------------418
	"输入Y坐标信息错误",------------------419
	"系统检测到您的属性数据异常，请重新登陆",------------------420
	"剩余%s天",------------------421
	"您的角色已被封停，详情请联系客服人员",------------------422
	"恭喜玩家%s，获得钻石%s",-----------423
	"排位赛奖励",-----------424
	"战神令不足",-----------425
	"已到达顶级，无法成长",-----------426
	"装备退化后将会获得以下物品",-----------427
	"每次只能选择五个宝物",-----------------428
	"请选择奖励",-----------------429
	"可兑换%d次",-----------------430
	"可领取%d次",-----------------431
	"阵容上齐六个数码兽后才可上阵援军",-----------------432
	[433] = "登陆",-----------------432
}
--- 定义活动信息
_tip_info_activity = {
	-- 此处不填写值,在下面标记的序号里填写
}
_tip_info_activity[21]={"每日充值送礼","有钱任性，活动期间，当日累计充值达到指定金额即可领取各种稀有资源和道具。"}
_tip_info_activity[24]={"登陆送礼","活动期间，累计登陆满指定天数，就可获得各种稀有资源哟~！","累计登入%d天"}
_tip_info_activity[43]={"竞技双倍","活动期间，活动期间，参与竞技场的玩家，可获得指定道具的双倍奖励~！"}
_tip_info_activity[44]={"副本双倍","活动期间，活动期间，副本掉落的指定道具的掉落率将翻倍，抓紧时间刷刷刷！"}
_tip_info_activity[45]={"单笔充值送礼","有钱任性，活动期间，单笔充值达到指定金额即可领取豪华大礼","单笔充值%d钻石"}
_tip_info_activity[46]={"招募折扣","活动期间，活动期间，在商城进行超神入化级数码兽招募可享8折优惠！凑阵容的好机会！"}
_tip_info_activity[47]={"光丘守护","侵略者来袭，活动期间，攻击侵略者和击杀侵略者的玩家都会获得丰厚的奖励！",{"攻击侵略者%d名","击杀侵略者%d名"}}
_tip_info_activity[62]={"碎片兑换","活动时间内，可以兑换指定道具！"}------------------【数码宝贝】限时兑换
_tip_info_activity[70]={"人才市场","活动期间，可以用少量资源换取指定稀有数码兽！机不可失！"}-------------------限时兑换
_tip_info_activity[71]={"装备市场","活动期间，大量稀有装备折价大甩卖！快将你心仪已久的装备带走吧！"}---------------限时兑换
_tip_info_activity[76]={"折扣贩售","活动期间，玩家可以使用指定资源兑换稀有资源！心动不如行动！"}------------------------------------限时兑换
_tip_info_activity[90]={"点金双倍产出","活动期间，前十次点金获得的基础金币数量增加一倍，快去获得金币吧！"}------------------------------------点金双倍
_tip_info_activity[94]={"体力购买双倍","活动期间内，每日前五次购买体力获得双倍体力，机会不容错过！"}
_tip_info_activity[97]={"主线关卡双倍掉落","活动时间内，主线关卡物品双倍掉落！快去战斗吧！"}
_tip_info_activity[98]={"精英关卡双倍掉落","活动时间内，精英关卡物品双倍掉落！快去战斗吧！"}
_tip_info_activity[99]={"金币挑战双倍掉落","活动时间内，金币挑战活动关卡物品双倍掉落！快去战斗吧！"}
_tip_info_activity[100]={"精英关卡次数增加","活动时间内，精英关卡可挑战次数每天额外增加3次，快去获得心仪数码兽的碎片吧！"}
_tip_info_activity[101]={"金币挑战次数增加","活动时间内，金币挑战活动关卡可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[114]={"神兽来袭","%s来袭！活动时间内，可以通过神兽来袭抽卡（V%s以上玩家可见）获得！（抽卡次数不计入活动任务抽卡计数）", "%s、%s2选1！活动时间内，可以通过神兽来袭抽卡（V%s以上玩家可见）获得！（抽卡次数不计入活动任务抽卡计数）"}
_tip_info_activity[120]={"节日关卡掉落","活动时间内，主线关卡和精英关卡战斗胜利会有一定几率额外掉落%s（可以兑换稀有资源）！快去战斗吧！"}
_tip_info_activity[121]={"节日道具兑换","活动时间内，可以兑换指定道具！"}
_tip_info_activity[122]={"节日登陆有礼","活动时间内，完成对应目标就可以获得奖励！"}
_tip_info_activity[123]={"关卡掉落徽章","活动时间内，主线关卡和精英关卡战斗胜利会有一定几率额外掉落%s（可以兑换稀有资源）！快去战斗吧！"}
_tip_info_activity[124]={"徽章限时兑换","活动时间内，可以兑换指定道具！"}
_tip_info_activity[125]={"徽章登陆有礼","活动时间内，完成对应目标就可以获得奖励！"}
_tip_info_activity[126]={"任务赠送徽章","活动时间内，完成对应目标就可以获得奖励！"}
_tip_info_activity[128]={"经验挑战次数增加","活动时间内，经验副本（30级开放）可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[129]={"技之作战次数增加","活动时间内，技之副本（37级开启）可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[130]={"幻象挑战次数增加","活动时间内，幻象挑战（37级开启）可挑战次数每天额外增加1次，快去战斗吧！"}
_tip_info_activity[131]={"经验挑战双倍掉落","活动时间内，经验挑战物品双倍掉落！快去战斗吧！"}
_tip_info_activity[132]={"技之作战双倍掉落","活动时间内，技之挑战物品双倍掉落!快去战斗吧!"}
_tip_info_activity[133]={"幻象挑战双倍掉落","活动时间内，幻象挑战物品双倍掉落!快去战斗吧!"}
_tip_info_activity[134]={"数码试炼金币双倍","活动期间,每个试炼宝箱首次免费打开获得金币翻倍!"}
_tip_info_activity[135]={"净化必出数码兽","活动时间内,净化数码兽会必然刷新%s，快去挑战吧！"}

_vip_qianming = {
	{4,"没有金币怎么能养活我呢？","提督，再来一碗饭吧~~"},--------------------------------------------VIP0  金币500000
	{201,"哼哼，没体力了吧~快快退下吧~！","有了体力，就可以继续出击了！"},----------------------------VIP1  体力丸10
	{7,"想夺宝，没有精力怎么行？！","有了精力，就可以吊打“非提”了！"},--------------------------------VIP2  精力丸10
	{212,"箱子大甩卖了~走过路过，不要错过！","马上就可以跟北魔王买好吃的了，嘿嘿~"},------------------VIP3  橙色宝物箱子5
	{110,"嘿嘿，这个里面可以开出连装炮酱哟~","提督桑~快买呀~快买呀~~"},-------------------------------VIP4  橙色装备箱子5
	{220,"兽魂的荣誉，你值得拥有！","哇，这么多兽魂，还在等什么呢？"},--------------------------------VIP5  兽魂1000
	{129,"提督~提督，你快告诉我，谁最漂亮？","好多刷新令啊~不买吃亏哟~"},-----------------------------VIP6  刷新卡50
	{216,"棒棒各棒~精炼书可以强化装备哟~","要想拥有我这样的身材，必须精炼~"},-------------------------VIP7  高级精炼书100
	{113,"有了它，就可以精炼电探了！","电探和鱼雷都是需要宝物精炼书的哟~"},---------------------------VIP8  宝物精炼书500
	{102,"这点钱都不愿意出吗？提督。","那我晚上可就不会理你了，哼！"},--------------------------------VIP9  跃迁石1000
	{105,"这个我要了，提督，快来付钱！","阿犬，提督再不付钱，就去咬她！"},----------------------------VIP10 超级精炼书100
	{115,"Wow！Congratulations！","好多精炼书哇~提督，我要嘛~快给我吧~！"},---------------------------VIP11 宝物精炼书1000
	{5,"芯片源才是取得战斗胜利的关键！","这么多芯片源，简直要发大财了~！"},---------------------------VIP12 跃迁石2500
}
-- _string_piece_info
_probabilityName = {
	"高概率",
	"较高概率",
	"一般概率",
	"较低概率",
	"低概率",
	"极低概率",
}
-- 副本名称分类
_plot_copy_name = {
	"主线副本",
	"精英副本",
	"数码兽副本",
	"日常副本",
	"隐藏副本",
}

_ship_types_by_color = {
	"白色",		--1
	"绿色",		--2
	"蓝色",		--3
	"紫色",		--4
	"橙色",		--5
	"红色",		--6
	"金色",		--7

}

-- 名称
_my_gane_name = {
	"金币",---------------1
	"钻石",---------------2
	"竞技币",---------------3
	"战功",---------------4
	"天赋点",-------------5
	"试炼币",---------------6
	"战队经验",---------------7
	"体力",---------------8
	"体力",---------------9（废弃）
	"功能点",-------------10
	"竞技币",---------------11
	"体力",---------------12（废弃）
	"公会币",	--------13
	"其他项目站位",	-------------14
	"天赋点",	----------15
	"活跃度",	----------16
	"VIP经验",	----------17
}


tip_equip_numerical_info_explain = {
	"获得装备",
	"失去装备",
}

tip_equip_action_info_explain = {
	"装备强化",
	"装备一键强化",
	"装备升级",
	"装备装备",
	"装备卸下",
	"装备合成",
	"装备分解"
}


tip_online_time = {
	"您好，不能重复领取已领过的奖励",		--1
	"暂无可用装备，可去无限山碰碰运气哦~",		--2
}

--战士信息界面文字颜色
_hero_color_info = {
	--[[
	{95,92,83}, --灰的缘分
	{0,170,65}, --亮的缘分名称
	{117,39,3},--亮的缘分说明
	{95,92,83},--灰的天赋
	{230,12,10},--亮的天赋名称
	{255,144,0},--亮的天赋说明
	{240,109,0},--天赋需求
	{16,138,5},--无缘分无天赋的颜色
	{110,43,10},--资源更新的颜色
	--]]
	{172,172,172}, --灰的缘分
	{1,219,32}, --亮的缘分名称
	{220,78,0},--亮的缘分说明
	{172,172,172},--灰的天赋
	{233,10,10},--亮的天赋名称
	{255,155,58},--亮的天赋说明
	{220,78,0},--天赋需求
	{16,138,5},--无缘分无天赋的颜色
	{110,43,10},--资源更新的颜色
	{34,244,255},--资源更新的颜色10
	{255,255,0},--资源更新的颜色11
}


--品质颜色值
tipStringInfo_quality_color_Type = {
	{255,255,255},				--0白
	{0,255,0},					--1绿
	{0,255,255},				--2蓝
	{255,0,255},				--3紫
	{255, 150, 0},				--4橙
	{255,0,0},					--5红
	{255,255,0},				--6金
	{255,150,255},				--7
	{255,0,13},					--8
	{255,0,13},					--9
	{255,0,13},					--10
	{105,79,56},				--12 战士说明颜色
	{127,127,127},					--13 缘分未激活颜色
	{255,255,255},					--14 缘分激活颜色
}

--装备洗练 颜色值
tipStringInfo_EquipmentRefine_color_Type = {
	{0, 255, 53},   -- 加数值(+100)
	{255, 0, 53},   -- 减数值(-100)
	{255, 0, 53},   -- 最大数值(max100)
	{80, 253, 255},   -- 有数字显示时
	{80, 253, 255},   -- 无数字显示时
}
--阵容界面相关颜色值（已开启）
formation_relationship_color_Type = {
	{255,255,255},		--战士信息界面已经激活的缘分R0 G140 B0
	{205,65,6},				--小数码兽界面未激活缘分的灰色字未激活缘分 文本字 颜色R205 G65 B6
	{20,119,0},				--小数码兽颜色名字R20  G119  B0
	{131,55,0},			--小数码兽界面激活缘分 说明R131  G55  B0
	{146,118,118},		--战士信息界面未激活的缘分R:146   G:118  B:118
}

--数码兽阵容缘分激活
formation_relationship_color_Type_two = {
	{131,131,131},		--未激活
	{0,255,255},		--激活
}

-- 周几
timeUtil_WeekX = {
	"一",		--1
	"二",		--2
	"三",		--3
	"四",		--4
	"五",		--5
	"六",		--6
	"日",		--7
	"周",		--8
}

server_state_tip_str={
	{0, "关闭"},
	{0, "流畅"},
	{0, "新服"},
	{1, "服务器维护中，不妨先去喝喝茶"},
	{0, "推荐"},
	{0, "拥挤"},
	{1, "爆满了，再挤就要发生踩踏事件了"},
}

--品质颜色值
color_Type = {
	{255,255,255},----1 纯白色
	{0,255,0}, -------2 亮绿色
	{0,255,255},------3 亮蓝色
	{255,0,255},------4 亮紫色
	{255, 150, 0},----5 橙色
	{255,0,0},--------6 大红色
	{255,182,0},------7 纯黄色{255,150,255},----8 暗粉色
	{110,43,8},----—--9 深棕色
	{255,0,13},------10 
	{255,0,13},------11 
	{255,75,0},------12 黑石山
	{50,50,50},------13 
	{255,234,42},----14 国战
	{252,244,168},---15 国战
	{255,85,39},-----16 个人战报
	{255,238,141},---17 个人战报
	{234,206,124},---18 将魂副本伤害对象
	{210,103,215},---19 将魂副本伤害对象
	{255,208,0},-----20 聊天
	{255,134,0},-----21 聊天
	{255,222,76},----22 聊天
	{0,120,255},-----23 聊天
	{255,249,201},---24 聊天
	{255,232,166},---25 数码兽羁绊
	{18,227,0},------26 数码兽羁绊
	{98,55,0},------27 小详情界面文字
	{10,103,0},------28 小详情界面数字
}

game_infomation_tip_str = {			-- 杂项
	"3",---------------------------------- 1 	三国无双
	"6",---------------------------------- 2 	三国无双
	"9",---------------------------------- 3 	三国无双
	"ttttttt",---------------------------- 4 	三国无双排行榜界面
	"yyyyyyyyyy",------------------------- 5 	三国无双排行榜界面
	"xfnhgx",----------------------------- 6 	三国无双排行榜界面
	"【",----------------------------------7 	TreasureChooseForRebornCell
	"】",----------------------------------8 	TreasureChooseForRebornCell
	"300",---------------------------------9 	HeroRecruitListView  招募一次花费钻石显示值
	"/120",--------------------------------10 	TreasuresListView  背包上限
	"想通过关卡，必须消灭我们全队",------11 	GuanQia  
	"第一关",------------------------------12 	GuanQia  
	"敌方全灭",----------------------------13 	GuanQia   
	"90",----------------------------------14 	PaiHang   
	"89",----------------------------------15 	PaiHang   
	"70",----------------------------------16 	PaiHang   
	"yyyyy",-------------------------------17 	ShopList   
	"100",---------------------------------18 	ShopList   
	"20/30",-------------------------------19 	ShopList   
	"到达40星可购买",----------------------20 	ShopList   
}

game_mine_tip_str = {			-- 领地攻讨
	"占领",-------------------------------------------- 1
	"后可解锁此据点",---------------------------------- 2
	"钻石",-------------------------------------------- 3
	"亮晶晶的钻石,散发着土豪的气息",------------------- 4
	"防守据点中",------------------------------------------ 5
	"VIP等级不足",--------------------------------------6
	
}

_strengthen_master_info = {		-- 强化大师
	"四件装备每强化10级，\r\n获得一次能力提升", ------1
	"四件装备每精炼2级，\r\n获得一次能力提升",--------2
	"两件宝物每强化5级，\r\n获得一次能力提升",--------3
	"两件宝物每精炼1级，\r\n获得一次能力提升",--------4
	"凑齐四件装备，即可开启强化大师！",------=--5
	"全身装备强化",-----------------------------------6
	"全身装备精炼",-----------------------------------7
	"全身宝物强化",-----------------------------------8
	"全身宝物精炼",-----------------------------------9
	"装备强化大师",-----------------------------------10
	"装备精炼大师",-----------------------------------11
	"宝物强化大师",-----------------------------------12
	"宝物精炼大师",-----------------------------------13
	"级达成",-----------------------------------------14
}

_treasure_info = {			-- 回收说明
	"数码兽分解", -----------------------------------------------------1
	"装备分解",------------------------------------------------------2
	"数码兽退化",------------------------------------------------------3
	"宝物退化",------------------------------------------------------4
	"1.退化后,初始宝物得到保留,并返还精炼过程中消耗的同名宝物",------5
	"2.返还所有强化过程中消耗的经验和金币",--------------------------6
	"3.返还所有宝物精炼书(不返还精炼时消耗的金币)",------------------7
	"1.退化后,返还初始数码兽碎片,并返还进化过程中消耗的同名数码兽碎片.(不返还进化时消耗的金币)",------------------8
	"2.返还所有升级过程中消耗的经验和金币(不返还经验少于5000的部分)",------------------9
	"3.返还所有培养液(不返还培养时消耗的钻石和金币)",------------------10
	"4.返还所有芯片石(不返还当前停留在经验条上,所消耗的芯片石)",-------11
	"5.返还跃迁中,所消耗的跃迁石、金币、同名数码兽",---------------------12
	"6.返还消耗的跃迁装备,全部返还到包裹中",---------------------------13
	"1.所有装备都可以进行分解,按照装备品质返还荣誉",-------------------14
	"2.返还所有强化过程中消耗的金币",----------------------------------15
	"3.返还所有装备精炼书",--------------------------------------------16
	"1.绿色及绿色以上的数码兽可以分解",---------------------------------------------17
	"2.以兽魂形式返还数码兽本身以及进化时消耗的同名数码兽(不返还进化时消耗的金币)",---18
	"3.返还所有升级过程中消耗的经验和金币(不返还经验少于5000的部分)",-------------19
	"4.返还所有培养液(不返还培养时消耗的钻石和金币)",-----------------------------20
	"5.返还所有芯片石(不返还当前停留在经验条上,所消耗的芯片石)",------------------21
	"6.返还跃迁中,所有消耗的跃迁石和金币;消耗的同名数码兽,以兽魂形式返还",----------22
	"7.所有消耗的跃迁装备,全部以数码魂的形式返还(不返还合成跃迁装备所消耗的金币)",--23
}

_equip_ment_info = {			-- 装备退化说明
	"装备退化",--------------------------------------------------------1
	"1.退化后,初始装备将以碎片形式返还。",-----------------------------2
	"2.返还所有强化过程中消耗的金币。",--------------------------------3
	"3.返还所有精炼过程中消耗的精炼书。",------------------------------4
	"4.返还所有升星过程中消耗的同名装备碎片和金币（不返还钻石）",------5
}
--片头战斗数据
_all_star_head_leader = {
[[182 0 1722 1 1 5 11833 1 11 0 0 5 1000000 0 1 11833 1 王小虎 11834 2 12 0 0 5 1000000 0 1 11834 1 王小龙 11835 3 31 0 0 4 1000000 0 1 11835 1 石黑龙 11836 4 18 0 0 5 1000000 0 1 11836 1 蚩尤 11837 6 501 0 0 6 1000000 0 1 11837 1 男主角 0  1  6 11827 1 49 0 0 4 1000000 0 1 11827 1 金罗汉 11828 2 15 0 0 5 1000000 0 1 11828 1 东方无敌 11829 3 55 0 0 4 1000000 0 1 11829 1 王风雷 11830 4 13 0 0 5 1000000 0 1 11830 1 火云邪神 11831 5 2 0 0 6 1000000 0 1 11831 1 天下无敌 11832 6 1 0 0 6 1000000 0 1 11832 1 天下无敌返老还童 0 ]],
[[39 1 20 1 1 0 3 0 0 4 212 0 1 251 0 0 3 1 -1 -1 1 3 0 0 100000 1 0 0 0 0 0 0 1 3 0 0 3 716 0 1 798 0 1 3 3 -1 -1 0 1 0 0 200000 1 0 0 0 0 2 0 0 200000 1 0 0 0 0 3 0 0 200000 1 0 0 0 0 0 0 0 2 0 0 4 65 0 1 70 0 0 2 1 -1 -1 1 3 0 0 100000 1 0 0 0 0 0 0 1 1 0 0 2 590 0 1 663 0 1 1 1 -1 -1 0 1 0 0 200000 1 0 0 0 0 0 0 1 2 3 0 0 3908 0 0 3 1 2 0 0 0 3908 1 4104 0 1 2 3 -1 -1 0 1 0 0 250000 1 0 0 0 0 2 0 0 250000 1 0 0 0 0 3 0 0 250000 1 0 0 0 1 3 0 0 0 3908 1 4104 0 1 3 0 -1 -1 1 1 0 0 0 3908 1 4104 0 1 1 0 -1 -1 0 0 0 0 1 0 0 4 44 0 1 46 0 0 1 3 -1 -1 1 1 0 0 150000 1 0 0 0 1 2 0 0 150000 1 0 0 0 1 3 0 0 150000 1 0 0 0 0 0 0 0 2 3 0 0 4496 0 0 3 0 2 0 0 0 3908 1 4780 0 0 2 3 -1 -1 1 1 0 0 300000 1 0 0 0 1 2 0 0 300000 1 0 0 0 1 3 0 0 300000 1 0 0 0 0 3 0 0 0 3908 1 4780 0 0 3 0 -1 -1 0 1 0 0 0 3908 1 4780 0 0 1 0 -1 -1 0 0 0 1 4 0 0 3 86 0 1 95 0 1 4 4 -1 -1 0 1 0 0 250000 1 0 0 0 0 2 0 0 250000 1 0 0 0 0 3 0 0 250000 1 0 0 0 0 4 0 0 250000 1 0 0 0 0 0 0 0 4 0 0 2 191 0 1 218 0 0 4 1 -1 -1 1 2 0 0 300000 1 0 0 0 0 0 0 1 5 0 0 0 3781 0 1 3967 0 1 5 3 -1 -1 1 2 0 0 9999999 1 0 0 1 0 0 1 3 0 0 9999999 1 0 0 1 0 0 1 4 0 0 9999999 1 0 0 1 0 0 0 0 0 1 5 0 0 3 3782 0 1 3968 0 1 5 4 -1 -1 0 1 0 0 9999999 1 0 0 1 0 0 0 2 0 0 9999999 1 0 0 1 0 0 0 3 0 0 9999999 1 0 0 1 0 0 0 4 0 0 9999999 1 0 0 1 0 0 0 0 0 0 6 0 0 6 2 0 1 3 0 0 6 1 -1 -1 1 5 0 0 9999999 1 0 0 1 0 0 0 0 0 1 6 0 0 3 3803 0 1 3989 0 1 6 1 -1 -1 0 6 0 0 9999999 1 0 0 1 0 0 0 0 1]],
[[182 0 1722 1 1 5 11833 1 11 0 0 5 1000000 0 1 11833 1 王小虎 11834 2 12 0 0 5 1000000 0 1 11834 1 王小龙 11835 3 31 0 0 4 1000000 0 1 11835 1 石黑龙 11836 4 18 0 0 5 1000000 0 1 11836 1 蚩尤 11837 6 511 0 0 6 1000000 0 1 11837 1 女主角 0  1  6 11827 1 49 0 0 4 1000000 0 1 11827 1 金罗汉 11828 2 15 0 0 5 1000000 0 1 11828 1 东方无敌 11829 3 55 0 0 4 1000000 0 1 11829 1 王风雷 11830 4 13 0 0 5 1000000 0 1 11830 1 火云邪神 11831 5 2 0 0 6 1000000 0 1 11831 1 天下无敌 11832 6 1 0 0 6 1000000 0 1 11832 1 天下无敌返老还童 0 ]],
[[39 1 20 1 1 0 1 0 0 3 442 0 1 109 0 0 1 1 -1 -1 1 2 0 0 2847 1 0 0 0 0 0 0 1 2 0 1 0 1541 0 1 468 0 1 2 3 -1 -1 0 1 1 0 1282 1 0 0 0 0 3 1 0 1282 1 0 0 0 0 5 0 0 1282 1 0 0 0 0 0 0 0 3 0 0 3 453 0 1 112 0 0 3 1 -1 -1 1 2 0 0 2963 1 0 0 0 0 0 0 0 5 0 1 0 1 0 1 1 0 0 5 1 -1 -1 1 2 1 0 384 1 0 0 0 0 0 0 0 1 0 0 3 443 0 1 110 0 0 1 1 -1 -1 1 2 0 0 6847 1 0 0 0 0 0 0 1 2 0 1 0 1542 0 1 469 0 1 2 3 -1 -1 0 1 1 0 22817 1 0 0 0 0 3 1 0 22817 1 0 0 0 0 5 0 0 22817 1 0 0 0 0 0 0 0 3 2 0 1 103 0 0 2 0 3 0 0 1 103 1 488 0 0 3 1 -1 -1 1 2 0 0 876486 1 0 0 1 0 0 0 1 0 0 1 103 1 489 0 0 1 0 -1 -1 0 0 1]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 503 0 0 2 999999 0 0 56 1 航母舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 511 0 0 2 999999 0 0 1321 1 驱逐舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
[[182 0 1724 1 1 3 0 1 102 0 0 4 999999 0 0 122 1 扬威 0 3 103 0 0 4 999999 0 0 133 1 超勇 0 5 513 0 0 2 999999 0 0 1376 1 巡洋舰 0  1  1 11744 2 2 2 0 5 999999 0 1 11744 1 金刚合体怪 0 ]],
}


--属性变更时提示的颜色值
tipStringInfo_property_change_color_Type = {
	{255,246,190}, 	--白色  r254  g246  b190	-1
	{68,206,36},	--绿色  r68   g206  b36		-2
	{0,180,255},	--蓝色  r0    g180  b255	-3
	{193,72,255},	--紫色  r193  g72   b255	-4
	{255, 150, 0},	--橙色  r255  g150  b0		-5
	{252,18,0},		--红色  r252  g18   b0		-6
	{255,192,0},	--金色  r252  g18   b0		-7
}


tipStringInfo_hero_change_Type = {
	"更换数码兽成功!",			--1
	"数码兽升级成功!",			--2
	"数码兽经验增加",				--3
	"装备卸下成功",				--4
	"装备更换成功",				--5
	"上阵数码兽成功!",			--6
	"穿戴装备成功!",			--7
	"装备宝物成功!",			--8
}

-- 竞技场的文本
tipStringInfo_arena = {
	"%d名内刷新最高排名，可获得大量钻石！", --1
	"每天%s发放", --2
	"杀入%d名可获得每日奖励", --3

}

-- 抢夺的文本
tipStringInfo_plunder = {
	"免战%d小时", --1
	"尚未集齐所有残卷，无法合成",--2
	"级",--3
	"第%d次",--4
	"对手匹配成功",--5
	"抢夺他人会解除免战状态，要继续吗？", --6
	"使用免战令可保护您的宝物残卷不被抢走。", --7
	"您已经处于免战中，\r\n剩余%s的免战时间，\r\n需要重复使用吗？" --8
	
}

-- 购买道具窗口
tipStringInfo_prop_buy = {
	-- 此序列根据 pirates_config中的273 的次序定义
	-- [1] 购买窗口标题
	-- [2] 使用后的提示语
	{"",""},-- 跃迁石,
	{"",""},-- 宝物精炼书,
	{"",""},-- 刷新令,
	{"",""},-- 天命石,
	{"",""},-- 超级精炼书,
	{"",""},-- 高级精炼书,
	{"",""},-- 中级精炼书,
	{"",""},-- 初级精炼书,
	{"",""},-- 培养液,
	{"",""},-- 进化石,
	{"使用免战旗可保护您的宝物碎片不被抢走",""},-- 免战令（小）,
	{"使用免战旗可保护您的宝物碎片不被抢走",""},-- 免战令（大）,
	{"",""},-- 小型开发书,
	{"",""},-- 大型开发书,
	{"您目前的体力不足，使用【体力丸】补一补吧！","使用成功！体力补充完毕，快去【副本】吧！"},-- 体力丸,
	{"您目前的精力不足，使用【精力丸】补一补吧！",""},-- 精力丸,
	{"您目前的挑战书不足，使用【挑战书】恢复吧！","使用成功,挑战书增加1个！"},-- 挑战书
}
tipStringInfo_prop_buy_tip = {
	"%s数量不足,请先购买",--1
	"购买成功",--2
	"使用%s成功",--3
}


plunder_probability = {
	{500, "高概率"},
	{0, "较高概率"},
	{250, "一般概率"}, 
	{0, "较低概率"},
	{150, "低概率"},
	{0 , "极低概率"}
}

plunder_five = { -- 哪种概率时显示抢5次
	{2, 500}, 	--蓝色品质时需要这么多
	{3, 250},	--紫色品质时需要这么多
	{4, 150},	--橙色品质时需要这么多
}
-- 0白色
-- 1绿色
-- 2蓝色
-- 3紫色
-- 4橙色
-- 5红色
-- 6金色

tipStringInfo_destiny = {
	"恭喜获得属性加强", --1

}

-- 三国无双的文字
tipStringInfo_trialTower = {
	"重置次数已用完", --1
	"可免费重置%d次", --2
	"未上榜",	--3
	"星",	--4
	"今日可买%d次",	--5
	"到达%d星可购买",	--6
	"%d~%d关",--7
	"第%d关",--8
	"你还可以继续挑战，不需要重置", --9
	"星数不足",--10
	"请先选择一个合适的属性加成",--11
	"星数不足",--12
	"没有任何属性加成",--13
	"恭喜达成通关条件：", --14
	"没有达成通关条件：", --15
	"通过了%d关，可重置挑战", --16
	"(%d级开启扫荡)", --17
	"此关卡暂未开启",--18
	"你确定要回到第一层，从头开始吗？",--19
	"今日可买%d次",--20
	"荣誉不足",--21
	"领取成功",--22
	"进行重置，重置会回到第一层哦！",--23
	"今日还可钻石重置%d次",--24
	"更多",--25
	"前方战斗过于凶险,本层无法使用一键3星,还请谨慎选择",--26
	"恭喜你在第%d~%d关中,共获得了9星",--27
	"已达购买上限",--28
	"红色装备精华数量不足",--29
	"52级开启扫荡",--30
	"恭喜你在第%d~%d关中,共获得了%d星",--31
	"当前自动扫荡至第%d关（系统会帮您自动选择加成BUFF），确定扫荡？",--32
	"已超过历史最高三星关卡，不可扫荡哦！",--33
}

tipStringInfo_trialTowerBattleDescribe = {
	{"在%d回合内获胜","当前回合：",99},
	{"我方死亡不超过%d人","阵亡人数：",6},
	{"剩余血量高于%d","我方血量：",0},
}

-- 暴击属性用的
tipStringInfo_trialTower_multiplying_color = {
	{198,0,255},----1
	{198,0,255}, -------2
	{255,126,0},------3 

}

-- 暴击属性用的
tipStringInfo_trialTower_multiplying = {
	"暴击", --1
	"大暴击", --2
	"幸运暴击", --3
	"双倍", --是否双倍(0,1) -4
}

tipStringInfo_trialTower_attribute = {
	"生命加成",--0 血
	"最终伤害",--1 伤
	"暴击率",--2 爆
	"命中率",--3 命
	"最终减伤",--4 免
	"抗暴率",--5 抗   攻击（%）+5
	"闪避率",--6 闪
}

-------------------------------------------------------------------
-- 0.生命          1.攻击          2.物防           3.魔防
-- 4.生命（%）     5.攻击（%）     6.物防（%）      7.魔防（%）
-- 8.暴击率（%）   9.抗暴率（%）  10.格挡率（%）   11.破击率（%）
-- 12.命中率（%）  13.闪避率（%）  14.物理免伤（%） 15.魔法免伤（%）
-- 16.治疗率（%）  17.被治疗率（%）18.最终伤害      19.最终减伤
-- 20.初始怒气     21.体质         22.力量          23.灵力
-- 24.物理攻击     25.魔法攻击     26.治疗值        27.被治疗值
-- 28.燃烧伤害     29.中毒伤害     30.燃烧免伤      31.中毒免伤
-- 32.经验         33.最终伤害（%）34.最终减伤（%） 35.PVP终伤（%）
-- 36.PVP免伤（%）
--------------------------------------------------------------------
-- 三国无双属性加成
-- 数值从0 开始,自行+1

tipStringInfo_trialTower_attribute_info = {	
	{"生命","+%d"},	--1
	{"攻击","+%d"},	--2
	{"防御","+%d"},	--3
	{"灵防","+%d"},	--4
	{"生命","+%d","%"},	--5
	{"攻击","+%d","%"},	--6
	{"防御","+%d","%"},	--7
	{"灵防","+%d","%"},	--8
	{"暴击率","+%d","%"},	--9	
	{"抗暴率","+%d","%"},	--10
	{"格挡率","+%d","%"},	--11
	{"破击率","+%d","%"},	--12
	{"命中率","+%d","%"},	--13
	{"闪避率","+%d","%"},	--14
	{"物理免伤","+%d","%"},	--15
	{"灵压免伤","+%d","%"},	--16
	{"治疗率增加","+%d","%"},	--17
	{"被治疗率增加","+%d","%"},	--18
	{"最终伤害","+%d"},	--19
	{"最终减伤","+%d"},	--20
	{"初始怒气","+%d"},	--21
	{"体质","+%d"},	--22
	{"力量","+%d"},	--23
	{"灵力","+%d"},	--24
	{"物理攻击","+%d"},	--25
	{"额外伤害","+%d"},	--26
	{"治疗值","+%d"},	--27
	{"被治疗值","+%d"},	--28
	{"灼烧伤害","+%d"},	--29
	{"中毒伤害","+%d"},	--30
	{"灼烧免伤","+%d"},	--31
	{"中毒免伤","+%d"},	--32
	{"经验","+%d"},	--33
	{"伤害加成","+%d","%"},	--34
	{"伤害减免","+%d","%"},	--35
	{"PVP终伤","+%d","%"},	--36
	{"PVP免伤","+%d","%"},	--37
	{"初始合击点数","+%d"},	--38
	{"每次出手增加的怒气","+%d"},	--39
	{"灼烧伤害","+%d","%"},	--40
	{"吸血率","+%d","%"},	--41
	{"怒气","+%d"},	--42
	{"反弹率","+%d","%"},	--43
	{"暴击强度","+%d","%"},	--44
	{"免控率","+%d","%"},	--45
	{"小技能触发概率","+%d","%"},	--46
	{"格挡强度","+%d","%"},	--47
	{"控制率","+%d","%"},	--48
	{"治疗效果","+%d","%"},	--49
	{"——","+%d","%"},	--50
	{"数码兽类型克制伤害","+%d","%"},	--51
	{"溅射伤害","+%d","%"},	--52
	{"技能伤害","+%d","%"},	--53
	{"被治疗率减少","+%d","%"},	--54
	{"伤害提升","+%d","%"},	--55
	{"必杀伤害率","+%d","%"},	--56
	{"增加造成的必杀伤害","+%d","%"},	--57
	{"减少造成的必杀伤害","+%d","%"},	--58
	{"增加暴击伤害","+%d","%"},	--59
	{"减少暴击伤害","+%d","%"},	--60
	{"受到的必杀伤害增加","+%d","%"},	--61
	{"怒气回复速度","+%d","%"},	--62
	{"受到伤害降低","+%d","%"},	--63
	{"降低攻击","+%d","%"},	--64
	{"降低防御","+%d"},	--65
	{"伤害加成百分比提升（倍数）","+%d","%"},	--66
	{"降低必杀伤害率","+%d","%"},	--67
	{"降低伤害减免","+%d","%"},	--68
	{"降低防御","+%d","%"},	--69
	{"降低怒气回复速度","+%d","%"},	--70
	{"数码兽类型克制伤害加成","+%d","%"},	--71
	{"数码兽类型克制伤害减免","+%d","%"},	--72
	{"降低攻击","+%d"},	--73
	{"必杀抗性","+%d","%"},	--74
	{"减少必杀抗性","+%d","%"},	--75
	{"降低免控率","+%d","%"},	--76
	{"复活概率","+%d","%"},	--77
	{"被复活概率","+%d","%"},	--78
	{"复活继承血量","+%d","%"},	--79
	{"复活继承怒气","+%d","%"},	--80
	{"被复活继承血量","+%d","%"},	--81
	{"被复活继承怒气","+%d","%"},	--82
	{"增加复活概率","+%d","%"},	--83
	{"增加复活继承血量","+%d","%"},	--84
}

tipStringInfo_resurrection_info_tips = {
	{"指定数码兽复活，生命恢复","+%d","%"},	--1			复活用
	{"指定数码兽生命恢复","+%d","%"},	--1			单体加血用
	{"全体数码兽怒气恢复","+%d"},	--1			全体加怒用
	{"指定数码兽怒气恢复","+%d"},	--1			单体加怒用
}

tipStringInfo_trialTower_attribute_icon_info = {
	{1,"攻击系列"},
	{2,"防御系列"},
	{3,"暴击系列"},
	{4,"格挡系列"},
}

-- 战斗buff美术字索引对照表
_battle_buff_effect_dictionary = {
	-- effect id       buff type
	"-1",	-- 0为攻击
	"-1",	-- 1为加血
	"artword_34",	-- 2为加怒
	"artword_35",	-- 3为减怒
	"-1",	-- 4为禁怒
	"xuanyun",	-- 5为眩晕
	"-1",	-- 6为中毒
	"artword_3",	-- 7为麻痹
	"artword_4",	-- 8为封技
	"zhuoshao",	-- 9为燃烧
	"-1",	-- 10为爆裂
	"artword_1",	-- 11为增加档格
	"tiebi",	-- 12为无敌
	"-1",	-- 13为必闪
	"-1",	-- 14为吸血
	"-1",	-- 15禁疗
	"-1",	-- 16盲目
	"artword_2",	-- 17冰冻
	"-1",	-- 18备用
	"-1",	-- 19备用
	"-1",	-- 20备用
	"zengjiagongji",	-- 21增加攻击
	"jiangdigongji",	-- 22降低攻击
	"zengjiafangyu",	-- 23增加防御
	"jiangdifangyu",	-- 24降低防御
	"hurt_add",	-- 25受到的伤害增加
	"hurt_sub",	-- 26受到的伤害降低
	"zengjiabaoji",	-- 27增加暴击
	"zengjiakangbao",	-- 28增加抗暴
	"zengjiamingzhong",	-- 29增加命中
	"zengjiashanbi",	-- 30增加闪避
	"chixuhuixue",	-- 31持续回血
	"artword_81",	-- 32清楚负面效果
	"artword_10",	-- 33造成的伤害增加
	"-1",	-- 34全体秒杀
	"-1",	-- 35固定伤害
	"artword_27",	-- 36降低治疗效果
	"-1",	-- 37溅射
	"artword_8",	-- 38增加格挡强度
	"artword_22",	-- 39降低格挡率
	"artword_18",	-- 40增加吸血率
	"-1",	-- 41反弹
	"-1",	-- 42小技能触发概率
	"artword_9",	-- 43增加破格挡率
	"artword_15",	-- 44增加反弹率
	"artword_11",	-- 45增加伤害减免
	"-1",	-- 46废弃
	"-1",	-- 47降低小技能触发概率
	"artword_20",	-- 48降低暴击伤害
	"artword_31",	-- 49减少造成的必杀伤害
	"artword_5",	-- 50嘲讽
	"artword_25",	-- 51降低伤害加成
	"artword_10",	-- 52增加伤害加成
	"artword_14",	-- 53增加控制率
	"artword_16",	-- 54增加造成的必杀伤害
	"artword_31",	-- 55减少必杀伤害率
	"-1",	-- 56降低怒气回复速度
	"-1",	-- 57提高怒气回复速度
	"artword_6",	-- 58增加暴击伤害
	"-1",	-- 59--
	"artword_6",	-- 60增加暴击强度
	"artword_26",	-- 61降低伤害减免
	"artword_16",	-- 62增加必杀伤害率
	"artword_7",	-- 63增加格挡率
	"artword_10",	-- 64增加数码兽类型克制伤害加成
	"artword_25",	-- 65增加数码兽类型克制伤害减免
	"artword_19",	-- 66降低暴击率
	"artword_21",	-- 67降低抗暴率
	"artword_17",	-- 68增加必杀抗性
	"artword_32",	-- 69减少必杀抗性
	"-1",	-- 70复活概率
	"-1",	-- 71复活继承血量
	"-1",	-- 72复活继承怒气
	"-1",	-- 73增加复活复活概率
	"-1",	-- 74增加复活继承血量
	"-1",	-- 75被复活概率
	"-1",	-- 76被复活继承血量
	"-1",	-- 77被复活继承怒气
	"artword_78",	-- 78免疫控制
	"-1",	-- 79复活
	"-1",	-- 80小技能伤害提升

}

-- 战斗buff光效索引对照表
_battle_buff_animation_dictionary = {
	-- effect id       buff type
	{"-1"},	-- 0为攻击
	{"-1"},	-- 1为加血
	{"-1"},	-- 2为加怒
	{"-1"},	-- 3为减怒
	{"-1"},	-- 4为禁怒
	{"5", 1, {"standby"}, {{2,105},{17,190},{25,190},{21,230}}},	-- 5为眩晕
	{"-1"},	-- 6为中毒
	{"7", 1, {"standby"}, {{0,20},{0,24},{0,42},{0,45}}},	-- 7为麻痹
	{"8", 1, {"standby"}, {{-8,100},{0,185},{16,185},{13,220}}},	-- 8为封技
	{"9", 1, {"standby"}, {{0,-20},{0,-24},{0,-32},{0,-32}}},	-- 9为燃烧
	{"-1"},	-- 10为爆裂
	{"-1"},	-- 11为增加档格
	{"12", 3, {"start", "standby", "byattack"}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}},	-- 12为无敌
	{"-1"},	-- 13为必闪
	{"-1"},	-- 14为吸血
	{"-1"},	-- 15禁疗
	{"-1"},	-- 16盲目
	{"18", 1, {"standby"}, {{0,0},{0,0},{0,0},{0,0}}},	-- 17冰冻
	{"-1"},	-- 18备用
	{"-1"},	-- 19备用
	{"-1"},	-- 20备用
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 21增加攻击
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 22降低攻击
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 23增加防御
	{"-1"},	-- 24降低防御
	{"-1"},	-- 25受到的伤害增加
	{"-1"},	-- 26受到的伤害降低
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 27增加暴击
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 28增加抗暴
	{"-1"},	-- 29增加命中
	{"-1"},	-- 30增加闪避
	{"-1"},	-- 31持续回血
	{"-1"},	-- 32清楚负面效果
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 33造成的伤害增加
	{"-1"},	-- 34全体秒杀
	{"-1"},	-- 35固定伤害
	{"-1"},	-- 36降低治疗效果
	{"-1"},	-- 37溅射
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 38增加格挡强度
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 39降低格挡率
	{"-1"},	-- 40增加吸血率
	{"-1"},	-- 41反弹
	{"-1"},	-- 42小技能触发概率
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 43增加破格挡率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 44增加反弹率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 45增加伤害减免
	{"-1"},	-- 46废弃
	{"-1"},	-- 47降低小技能触发概率
	{"-1"},	-- 48降低暴击伤害
	{"-1"},	-- 49减少造成的必杀伤害
	{"50", 1, {"standby"}, {{2,55},{17,100},{25,100},{21,180}}},	-- 50嘲讽
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 51降低伤害加成
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 52增加伤害加成
	{"-1"},	-- 53增加控制率
	{"-1"},	-- 54增加造成的必杀伤害
	{"-1"},	-- 55减少必杀伤害率
	{"-1"},	-- 56降低怒气回复速度
	{"-1"},	-- 57提高怒气回复速度
	{"-1"},	-- 58增加暴击伤害
	{"-1"},	-- 59--
	{"21", 2, {"start", "standby"}, {{0,-20},{0,-25},{0,0},{0,0}}, {{0,-20},{0,-25},{0,0},{0,0}}},	-- 60增加暴击强度
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 61降低伤害减免
	{"-1"},	-- 62增加必杀伤害率
	{"23", 2, {"start", "standby"}, {{0,32},{0,32},{0,32},{0,32}}, {{0,32},{0,32},{0,32},{0,32}}},	-- 63增加格挡率
	{"-1"},	-- 64增加数码兽类型克制伤害加成
	{"-1"},	-- 65增加数码兽类型克制伤害减免
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 66降低暴击率
	{"22", 2, {"start", "standby"}, {{0,25},{0,28},{0,40},{0,42}}, {{0,25},{0,28},{0,40},{0,42}}},	-- 67降低抗暴率
	{"-1"},	-- 68增加必杀抗性
	{"-1"},	-- 69减少必杀抗性
	{"-1"},	-- 70复活概率
	{"-1"},	-- 71复活继承血量
	{"-1"},	-- 72复活继承怒气
	{"-1"},	-- 73增加复活复活概率
	{"-1"},	-- 74增加复活继承血量
	{"-1"},	-- 75被复活概率
	{"-1"},	-- 76被复活继承血量
	{"-1"},	-- 77被复活继承怒气
	{"-1"},	-- 78免疫控制
	{"79", 3, {"start", "start", "start", "standby", "byattack"}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}, {{0,40},{0,40},{0,65},{0,65}}},	-- 79为复活
	{"-1"},	-- 80小技能伤害提升

}

tipStringInfo_mine_info = {
	"离线",	--1
	"月",--2
	"周",--3
	"天",--4
	"小时",--5
	"分钟",--6
	"%s数码兽",--7
	"%s特产",--8
	"%s简介",--9
	"(巡逻据点时有几率获得)",--10
	"巡逻据点中",	--11
	"巡逻据点完毕",	--12
	"下次收益时间:",--13
	"好友|x|击溃了侵略者，你获得了|y|",----------------------------14
	"玩耍%d小时后，",------------------------------------------------------15
	"|x|悠闲的完成了巡视工作，获得了|y|",------------------------16
	"本次巡逻据点完成，好多奖励啊！",------17
	"在门主人的关爱下大伙儿都过得非常滋润，请收下奖励！",-----18
	"主人加油，我去巡逻据点了！",-----19
	"你放心去战斗吧，这里就交给我啦！",--20
	"x%d进行%d小时",--21
	"的%s吗？",--22
	{"悠闲的巡逻","认真的巡逻","全力的巡逻"},--23
	"[%s]",--24
	"不要随意进入好友的据点！",--25 -- 未开启或非防守据点状态下
	"多谢出手相助！这些礼品就送给你啦！",--26 --镇压后获得奖励提示语
	"级",--27
	"已有据点：",--28
	"巡逻据点中的位置：",--29
	"被偷袭的据点：",--30
	"当前没有好友开启法易路岛，是否前往添加好友",--31
	"在线", --32
	}
--MineManagerFriendList

tipStringInfo_mine_patrol_color = {
	{255,238,94},	----1 时间颜色
	{255,255,255},	----2 普通的描述文字颜色
	{255,44,9},	----3 暴动的描述文字颜色
	{84,255,9},	----4 镇压的描述文字颜色
	{255,228,176},	----5 结束后的描述文字颜色
	{255,246,0},	----6 收益倒计时的颜色
	{255,255,255},	----7 收益倒计时标题的颜色
}

-- 侵略者中 界面刷新请求的间隔时间.单位是秒
tipStringInfo_betrayArmy_request_refresh_interval = 5*60
tipStringInfo_betrayArmy_info = {
	"今日可买%d次",	--1
	"战功不足",--2
	"已达购买上限",--3
	"红色数码兽精华数量不足",--4
	"进化石数量不足",--5
}

numberToStringArg = {
	"一",
	"二",
	"三",
	"四",
	"五",
	"六",
	"七",
	"八",
	"九",
	"十",
	"百",
	"千",
	"零"
}

--战斗内的1到3档的速度
_fight_run_speed = {
	0.72,--第一档的速度-0.85
	0.62,--第二档的速度-0.66
	0.4,--第三档的速度-0.6
	0.4,--第四档的速度-0.6
}

_fight_time_scale = {
	1.29,--第一档的速度
	1.7,--第二档的速度
	2.0,--第三档的速度
	2.5,--第四档的速度
}

--战斗内武将的进化缩放比利
_fight_evolution_scales = {
	1,--1级
	1,--2级
	1,--3级
	1,--4级
}

tipStringInfo_time_info = {
	"年",	--1
	"月",	--2
	"周",	--3
	"天",	--4
	"小时",	--5
	"分钟",	--6
	"秒",	--7
	"刚刚",	--8
	"之前",	--9
	"日",	--10
	"时",	--11
	}


-- Vip等级上限控制
_vip_max_grade = {
	18,
	}

-------------------------是否显示分享（0隐藏，1显示）
open_share_fun = 0

-------------------------分享描述文字
share_text = {
	{1,"邀请好友","我在玩最热血的格斗手游《龙虎门》，连击爽到爆！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},------------------------------------------
	{2,"通关主线副本第1章","哈哈哈，天下无敌也不是我的对手，我刚刚成功通关了《龙虎门》第1章，我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},----------------------------
	{3,"竞技场杀入前1000名","有志者事竟成！经过不懈努力，我终于杀到《龙虎门》竞技场前1000名了！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},------------------------------
	{4,"获得橙色数码兽","《龙虎门》的橙色数码兽果然给力！我刚得到一名强力橙色数码兽，我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},------------------
	{5,"主角达到30级","才一眨眼的功夫我的《龙虎门》主角就升到30级了？超爽啊！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},-------------------------------
	{6,"通关主线副本第8章","我刚刚跟龙虎三皇一起击败了大龙头！不信？快来《龙虎门》看看吧！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},--------------------------------
	{7,"主角达到50级","我的《龙虎门》主角升到50级了！战力更上一层楼！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},-----------------------------
	{8,"竞技场达到第1名","跪下膜拜吧！本座已经登顶竞技场最强之位！快来《龙虎门》一睹我的风采吧！我叫%s，我在%s服，别说我没告诉你哦，一起来耍吧！"},-------------------------
}

_learn_skill_str ={
	{"以柔克刚","灵活多变","至刚至阳","无坚不摧","攻防兼备","虚实莫测","朴实无华","出其不意"},
	{"无事件相同","1对事件相同","2对事件相同","3事件相同","3带2事件相同","4事件相同","5事件相同"}
}

_user_pic_index = {
}
_user_pic_index["200101"] = 200101
_user_pic_index["200201"] = 200201
_user_pic_index["200104"] = 200104
_user_pic_index["200203"] = 200203
push_close_class = 
{
	"CampaignClass",
	"DestinySystemClass",
	"HeroRecruitListViewClass",
	"ShopClass",
	"RefiningFurnaceClass",
	"LearingSkillsDevelopClass",
	"ActivityWindowClass",
	"HeroShopClass",
	"OpenServerActivityClass",
	"SevenDaysManagerClass",
	"RechargeDialogClass",
	"LPVEMapClass",
	"HeroStorageClass",
	"PropStorageClass",
	"EmailManagerClass",
	"FameHallClass",
	"FriendManagerClass",
	"PropStorageClass",
	"ArenaClass",
	"PlunderClass",
	"TrialTowerClass",
	"WorldBossClass",
	"HeroDevelopClass",
	"FormationTigerGateClass",
	"DailyTaskClass",
	"CaptureResourceClass",
	"EquipStrengthenRefineStrorageClass",
}
csb_cacher_path = {
	--{1,"activity/7days/week_Activities_list.csb","6","七日活动"},
	--{2,"activity/DailyTasks/dailytasks_list.csb","8","日常任务"},
	--{3,"activity/wonderful/daily_attendance_list.csb","8","签到"},
	--{4,"activity/wonderful/landed_gifts_list.csb","6","累积充值"},
	--{5,"activity/wonderful/open_service_fund_list.csb","6","开服基金"},
	--{6,"activity/wonderful/share_weixin_list.csb","6","微信分享"},
	{7,"campaign/ArenaStorage/ArenaStorage_list_role.csb","10","竞技场主"},
	--{8,"campaign/ArenaStorage/ArenaStorage_ranking_list.csb","6","竞技场排行榜"},
	--{9,"campaign/ArenaStorage/ArenaStorage_shop_list.csb","6","竞技场商店"},
	--{10,"campaign/Snatch/indiana_list.csb","6","抢夺宝物界面"},
	--{11,"campaign/Snatch/snatch_results_list.csb","6","夺5次结算列表"},
	--{12,"campaign/TrialTower/trial_tower_list_list.csb","6","无限山排行榜"},
	--{13,"campaign/TrialTower/trial_tower_raids_list.csb","6","一键三星结算列表"},
	--{14,"campaign/TrialTower/trial_tower_raids_list_1.csb","6","一键三星结算列表2"},
	--{15,"campaign/TrialTower/trial_tower_shop_list.csb","6","无限山商店"},
	--{16,"campaign/WorldBoss/worldBoss_ranking_list.csb","6","光丘守护界面排行榜"},
	--{17,"campaign/WorldBoss/worldBoss_ranking_list_1.csb","6","光丘守护界面排行榜2"},
	--{18,"campaign/WorldBoss/worldBoss_reward_list.csb","6","功勋奖励列表"},
	--{19,"campaign/WorldBoss/worldBoss_shop_list.csb","6","功勋商店列表"},
	--{20,"duplicate/mopping_results_list.csb","6","扫荡列表"},
	--{21,"duplicate/pve_leaderboard_list.csb","6","副本排行榜"},
	{22,"duplicate/pve_duplicate_k.csb","8","副本"},
	--{23,"email/email_list.csb","6","邮件列表"},
	--{24,"friend/friend_list.csb","6","好友列表"},
	--{25,"friend/friend_tuijian_list.csb","6","推荐好友列表"},
	--{26,"list/list_daoju_1.csb","8","商城道具列表"},
	--{27,"list/list_equipment_1.csb","8","装备仓库列表"},
	--{28,"list/list_equipment_sui_1.csb","8","装备碎片列表"},
	--{29,"list/list_equipment_Wear_1.csb","8","装备穿戴列表"},
	--{30,"list/list_property_1.csb","8","包裹界面"},
	--{31,"list/list_libao.csb","6","商城礼包列表"},
	{32,"packs/HeroStorage/sm_list_generals_big.csb","10","数码兽仓库列表"},
	--{33,"shop/package_preview_list.csb","6","礼包预览列表"},
	--{34,"shop/shop_chongzhi_list.csb","6","充值列表"},
	--{35,"shop/HeroShop/heroShop_list.csb","6","神秘商店列表"},
	--{36,"skills/skills_list_line_list.csb","4","更换技能列表"},
	--{37,"skills/skills_list_xx_list.csb","4","学习技能列表"},
	--{38,"system/famous_rank_list.csb","4","大师榜排行榜列表"},
	--{39,"system/Atlas_list.csb","6","图鉴列表"},
	--{40,"icon/item_big.csb","12","图标icon"},
	--{41,"formation/line_up_icon_up.csb","4","数码兽列表图标icon"},
	--{42,"campaign/Snatch/snatch.csb","2","宝物抢夺"},
	--{43,"secret_society/secret_map_icon.csb","30","资源抢夺"},
	--{44,"system/raiders_xzs_right.csb","5","攻略"},
}


--应用推送信息 格式: 时间 "12-30","内容","每天推送次数","类型","设置中的标题"

_app_push_notification = {
    -- {"24-0","主人的数码兽长期缺乏锻炼，已经快退化成数码蛋了哦！"},	----长时间未登录推送
	-- {"12-0","吃午餐了！"},	----领体力12点
	-- {"18-0","吃晚餐了！"},	----领体力18点
	
	{"9-00","早起的鸟儿有虫吃！","1","1","领取体力1"},	--------9点领取能量
	{"12-00","午饭时间到了，快上线培养您的数码兽吧！","1","2","领取体力2"},	--------12点领取能量
	{"18-00","黑暗的势力越来越强大，快上线领取体力消灭邪恶吧！","1","3","领取体力3"},	--------18点领取能量
	{"21-00","美好的夜宵时间，快上线与您的数码兽一起冒险吧！","1","4","领取体力4"},	--------21点领取能量
}

chat_sent_string = 
{
	"昵称不可为空",					---------------------1
	"请输入聊天内容",			---------------------2
	"请输入昵称:",					---------------------3
	"请输入文字:",					---------------------4
	"文字过多无法发送",				---------------------5
	"请输入信息:",					---------------------6
	"请输入好友名称",				---------------------7
	"请输入指挥官名称",				---------------------8
	"豪气冲天给大家赠送了拼手气红包，大家速度来抢，手速慢就没了哦",				---------------------9
	"获得金币",						---------------------10
	"您的手速太慢了，红包已经被抢完啦！",				---------------------11
	"您已抢过该红包了！",				---------------------12
	"获得代金券",				---------------------13
	"请不要重复发言",				---------------------14
	"聊天时间间隔太短",				---------------------15
	"内容含有非法字符，请修改",				---------------------16
	"不能赠送给自己",				---------------------17
	"确定",                        ---------------------18
	"请输入聊天内容",               ---------------------19繁体包这个为繁体2为简体
	"请输入指挥官名称",            -----------------20繁体包这个为繁体8为简体
}

---------【数码宝贝】资源加载时的提示文字
tipStringInfo_loading_notice_info = {
	"小提示：还记得那年和数码宝贝一起冒险的夏天吗？",					----  1
	"小提示：战斗中连续击打敌人，数码兽可获得攻击加成哦！",						----  2
	"小提示：这大概就是青春吧！",						----  3
	"小提示：选择正确的连击顺序会大幅提高战斗伤害",					----  4
	"小提示：去组个强力的数码宝贝战队吧！",							----  5
	"小提示：每天登陆后的第一件事是领取签到奖励",								----  6
	"小提示：阿尔法兽和奥米加兽，谁更强力呢？",					----  7
	"小提示：数码兽等级不能超过玩家角色等级",			----  8
	"小提示：合理布阵让战斗、生活、撩妹更轻松",			----  9
	"小提示：我们永远怀念和田光司老师！",				---- 10
	"小提示：完成日常任务可以获得大量战队经验",				---- 11
	"小提示：数码兽武器觉醒后会有大幅提高必杀效果",					---- 12
	"小提示：注意角色间的属性相克，不要老骂策划啊！",				---- 13
	"小提示：启动数码兽之间的羁绊关系会更加强大",		---- 14
	"小提示：每天登陆都有一次免费抽卡机会",		---- 15
	"小提示：活动副本可以掉落大量金币和经验道具",		---- 16
	"小提示：强化装备可以快速提升战斗力",		---- 17
	"小提示：公会战决赛为淘汰赛制，大家都要拼尽全力哟！",		---- 18
	"小提示：合理释放策略技能可以使战斗过程更加顺利",		---- 19
	"小提示：装备进阶可以快速获得战力提升",		---- 20
}

--------------------------------小助手推荐数码兽配置(小头像ID,名称,品质|小头像ID,名称,品质|……)
tipStringInfo_strategy_formation = {
	{337, "1031,石黑龙,4|1049,金罗汉,4"},											--病毒种
	{338, "1034,韦陀,4|1040,碎骨门主,4|1057,剑魔连城,4|1065,金鹏,4"},					--疫苗种
	{339, "1037,夺命老妖,4|1046,烈阳神,4|1050,毒将军,4|1063,翼龙,4"},					--数据种
	{340, "1035,小佩,4|1044,华九公,4|1051,药神明镜,4|1058,参圣,4"},						--其他
}
tipStringInfo_union_dynamic_color = {
	{255,242,94},	----1 时间颜色
	{255,244,183},	----2 普通的描述文字颜色
	{191,255,38},	----3 成员名称颜色
	{255,150,0},	----4 舰队经验颜色
	{255,0,0},	--------5 副本NPC颜色
	{5,240,255},	----6 祭天颜色-绿色简单
	{25,149,255},	----7 祭天颜色-蓝色普通
	{219,23,255},	----8 祭天颜色-紫色豪华
}
tipStringInfo_union_zhuangxiu_color = {
	{93,56,24},	----1 普通文字描述-黑色
	{205,5,0},	----2 成员名称颜色-红色
	{199,80,0},	----3 数值颜色
	{0,164,27},	----4 祭天颜色-绿色简单
	{19,119,204},	----5 祭天颜色-蓝色普通
	{161,12,188},	----6 祭天颜色-紫色豪华
}

tipStringInfo_union_str = {			-- 公会文字
	"内部公告",-------------------------------------------- 1
	"公会宣言",---------------------------------- 2
	"这是您自己",-------------------------------------------- 3
	"成员%s进行[%s]，为公会增加%s点经验",-------------------------------------------- 4
	"成员%s在[%s]时脑洞大开触发暴击，为公会增加%s点经验",-------------------------------------------- 5
	"成员%s加入公会，跟成员们打个招呼吧！",-------------------------------------------- 6
	"成员%s被逐出公会",-------------------------------------------- 7
	"会长%s由于长期不作为被成员%s弹劾，恭喜%s成为新的会长",-------------------------------------------- 8
	"成员%s被任命为副会长，大家热烈欢迎！",-------------------------------------------- 9
	"大家齐心协力，击杀[%s],为公会增加了%s点经验",-------------------------------------------- 10
	"众团员齐心协力，击破[%s]，快去领取通关奖励吧！",-------------------------------------------- 11
	"成员%s退出了公会",-------------------------------------------- 12
	"初级建设",-------------------------------------------- 13
	"普通建设",-------------------------------------------- 14
	"高级建设",-------------------------------------------- 15
	"公会%d级可购买",----------------------------------------16
	"已达购买上限",  ----------------------------------------17
	"今日可买%d次",  ----------------------------------------18
	"可购买%d次",  ----------------------------------------19
	"公会剩余%d件",  ----------------------------------------20
	"请选择公会战鼓标志",  ----------------------------------------21
	"请输入公会名称",  ----------------------------------------22
	"玄铁宝箱",-------------------------------------------- 23
	"青铜宝箱",-------------------------------------------- 24
	"白银宝箱",-------------------------------------------- 25
	"黄金宝箱",-------------------------------------------- 26
	"达到%s点公会贡献即可领取奖励",-------------------------------------------- 27
	"您已经领取过该奖励了！",-------------------------------------------- 28
	"成员%s进行[%s]，增加%s点贡献进度，为公会增加%s经验",-------------------------------------------- 29
	"只有你一人时才能解散公会",-------------------------------------------- 30
	"确定要解散公会吗？",-------------------------------------------- 31
	"您已成功解散公会",-------------------------------------------- 32
	"只有会长和副会长可以修改战鼓标志",-------------------------------------------- 33
	"公会等级不足，无法更换",-------------------------------------------- 34
	"未上榜",-------------------------------------------- 35
	"贡献值不足",-------------------------------------------- 36
	"名称中包含敏感字符",-------------------------------------------- 37
	"确定取消申请公会？",-------------------------------------------- 38
	"确定花费%s钻石创建公会？",-------------------------------------------- 39
	"恭喜您创建公会成功，快去召集成员加入吧！",-------------------------------------------- 40
	"您今日已建设过了，请明日再来！",-------------------------------------------- 41
	"花费一点金币就可以进行建设！",-------------------------------------------- 42
	"花费少量钻石就可以进行建设！",-------------------------------------------- 43
	"这是成长最快的建设方式！",-------------------------------------------- 44
	"VIP等级达到2级可开启",-------------------------------------------- 45
	"需要先转让会长之位才能退出公会",-------------------------------------------- 46
	"离开公会后24小时内将无法再次申请加入或创建公会，确认退出公会？",-------------------------------------------- 47
	"今日无人建设",-------------------------------------------- 48
	"确认解散公会？你可以做的更好",-------------------------------------------- 49
	"是否花费%s钻石购买%s",-------------------------------------------- 50
	"输入内容不能为空",-------------------------------------------- 51
	"您已被逐出公会",-------------------------------------------- 52
	"会长之位已移交给%s，让%s带领大家继续前进吧！", ---------------------------53
	"成员%s被任命为副会长", ----------------------------------54
	"副会长%s被罢免职位", ----------------------------------55
	"最多输入%s字", ----------------------------------56
	"没有更多公会了", ----------------------------------57
	"确认逐出成员", ----------------------------------58
	"该据点尚未开启", ----------------------------------59
	"放置于", ----------------------------------60
	"明", ----------------------------------61
	"暗", ----------------------------------62
	"信息不明", ----------------------------------63
	"您权限不足", ----------------------------------64
	"备战中", ----------------------------------65
	"战斗中", ----------------------------------66
	"休战中", ----------------------------------67
	"领取成功", ----------------------------------68
	"暂未加入公会", ----------------------------------69
	"剩余公会贡献不足", ----------------------------------70
	"报名成功", ----------------------------------71
	"阵容保存成功", ----------------------------------72
	"比赛中无法更换阵容", ----------------------------------73
	"至少需要保留一个数码兽", ----------------------------------74
	"数码兽上阵数量超过上限", ----------------------------------75
	"比赛中无法查看昨日战况", ----------------------------------76
	"公会全部成员被击败，公会战结束",---------------------------77
	"第%d轮比赛结束，成功进入下一轮",---------------------------78
	"公会战结束，奖励将在21:30准时发放~",---------------------------79
	"仅限攻型数码兽参赛",		--------------------------80
	"仅限防型数码兽参赛",		--------------------------81
	"仅限技型数码兽参赛",		--------------------------82
	"所有数码兽可参赛",			--------------------------83
	"所有数码兽可参赛",			-------------------------84
	"第%d场",			-------------------------85
    "报名时间:10:00-20:50，比赛开始时间21:00",			-------------------------86
    "您公会未进入本周公会战总排行前8，无法参加决赛",			-------------------------87
    "队",			-------------------------88
    "剩余人数:",			-------------------------89
    "最大连胜:",			-------------------------90
    "连胜场数:",			-------------------------91
    "总积分:",			-------------------------92
    "当前排名:",			-------------------------93
    "报名人数:",			-------------------------94
    "今天比赛已结束，请明天继续参加",			-------------------------95
    "本轮公会战已结束，请等待下一轮公会战！",			-------------------------96
	"参赛限定：只限%|4|!x@%数码兽参赛，每队%|4|!y@%个，共%|4|!z@%队",			-------------------------97
	"参赛限定：所有数码兽可参赛，每队%|4|!x@%个，共%|4|!y@%队",			-------------------------98
	"攻型",			-------------------------99
	"防型",			-------------------------100
	"技型",			-------------------------101
    "请先加入公会",			-------------------------102
    "战场情况(当前战场一)",			-------------------------103
    "战场情况(当前战场二)",			-------------------------104
    "战场情况(当前战场三)",			-------------------------105
    "%s打败了%s，奖励将在21:30准时发放~",			-------------------------106
    "公会无人参赛",			-------------------------107
    "贵公会无人参赛，奖励将在21:30准时发放~",			-------------------------108
    "由于%s公会该战场人数为0，自动判负！%s打败了%s",			-------------------------109
    "公会等级到达3级开启",			-------------------------110
	"报名",			-------------------------111
	"已报名",			-------------------------112
	"还没有加入公会",			-------------------------113
	"该战场您未被匹配到",			-------------------------114
}

_union_info = {
	"公会功能介绍",																									--1
	"1.成员可参与公会建设，集体通关公会副本可获得公会经验，用于提升公会等级。",										--2
	"2.公会初始可容纳30名成员，公会等级每提升1级，成员上限+2。", 													--3
	"3.公会等级提升后可以开启新的公会副本，提高建设进度奖励，在公会商店中也会开放更多奖励道具。",					--4
	"4.成员可以从公会建设和公会副本中获得公会贡献，公会贡献可以在公会商店中购买各种道具。",							--5
	"5.公会内最多可以有2名副会长，副会长有审核、逐出成员、更改内部公告、公会宣言、公会战鼓的权限。",				--6
	"6.玩家加入公会24小时内不允许被踢出公会。", 																	--7
	"7.只有会长可以解散公会，为了避免误操作，公会成员大于10人时禁止解散公会。", 									--8
	"8.创建公会7日内，公会成员数不足3人，并且公会等级为1级时，公会会自动解散。", 									--9
	"公会建设",																										--10
	"1.建设分为初级建设、普通建设、高级建设3种方式，成员每天可选择其中一种方式进行建设。", 							--11
	"2.建设时，有概率触发暴击，公会贡献和公会经验奖励翻1.5倍（贡献进度不翻倍）。", 									--12
	"3.公会进度到达对应要求后，全体公会成员均可领取建设进度奖励。", 												--13
	"4.公会等级越高，建设进度奖励越丰厚。", 																		--14
	"5.需注意，每天24:00系统会自动清空当天的建设进度奖励。", 														--15
	"6.每天的建设次数不能超过公会成员数上限。", 																	--16
}



--打开可能获得装备碎片的道具ID
can_get_some_equip_patch =
{
	52,
	53,
	54,
	55,
	56,
	57,
	58,
	59,
	60,
	64,
	65,
	66,
	75,
	84,
	85,
	86,
}


------------擂台赛
warcraft_tip = {
	"未上榜",-----------------1
	"达到%s即可领取",---------2
	"达到%s即可购买",---------3
	"虚位以待",---------------4
	"比赛时间:%s-%s",---------5
	"刷新对手",---------------6
	"刷新挑战次数",-----------7
	"距离擂台赛结束还剩",----------------------8
	"本届已结束，还请主人下次再战！",----------9
	"王者",-------------10
	"霸者",-------------11
	"勇者",-------------12
	"总积分：",-------------13
	"总胜点：",-------------14
	"剩余时间：",-------------15
	"开启时间：",-------------16
	"已结束",-------------17
	"进入擂台赛",-------------18
	"时辰未到",-------------19
	"刷新需消耗%s钻石",-------------20
	"普通赛",-------------21
	"进级赛",-------------22
	"定段赛",-------------23
	"免费次数：",-------------24
	"%s登录领取",-------------25
	"达到%d连胜即可领取",-------------26
	"无名之辈",-------------27
	"购买十次挑战次数",-------------28
}
---------------擂台赛提示框
_warcraft_states_string_info = {
	"晋升成功",
	"晋升失败",
	"掉段惩罚",
	"晋升赛",
	"恭喜由%s晋升至%s！",
	"晋升比赛失败，当前积分清零，还请您重头来过！",
	"由于您连续挑战失败，导致胜点低于段位要求，因此由%s降至%s！",
	"积分和胜点均达到晋升要求，\n完成3局2胜或者5局3胜的晋升赛\n即可成功晋升！",
}
--中文数字
chinese_num = {
	"一",		--1
	"二",		--2
	"三",		--3
	"四",		--4
	"五",		--5
	"六",		--6
	"七",		--7
	"八",		--8
	"九",		--9
	
}
---------时装
tipStringInfo_fashion_str = {
	"成功强化至%s级", -----------------------------------------1
	"换装成功", -----------------------------------------------2
	{77,77,77}, -------------------------------------------3
}

tipStringInfo_treasure_seat_str = {
	"[攻击]", -----------------------------------------1
	"[防御]", -----------------------------------------------2
	"装备于", -------------------------------------------3
	"已装备", -------------------------------------------4
}
---------------跃迁
_awaken_tipString_info = {
	"星", -----------------------------------------1
	"级", -----------------------------------------2
	"合成成功", -----------------------------------3
	"分解跃迁道具", -------------------------------4
	"跃迁至", -------------------------------------5
	"恭喜跃迁成功！", -----------------------------6
	"50级开启", -----------------------------------7
	"50级以上的数码兽才可进行跃迁", ---------------8
	"数码兽等级不足", -----------------------------9
	"跃迁已达到满级", -----------------------------10
	"需求等级：%s/%s", ----------------------------11
	"恭喜装备成功！", -----------------------------12
	"一星", ---------------------------------------13
	"二星", ---------------------------------------14
	"三星", ---------------------------------------15
	"（4回合内通关）", -----------------------------16
	"（8回合内通关）", -----------------------------17
	"（20回合内通关）", -----------------------------18
	"橙将或者红将才能跃迁", ---------------19
}

red_alert_all_str = 
{
	"分解数码兽，获取兽魂",							------------------1
	"获取高阶装备碎片，返还强化铜币和镶嵌的钻石", 	------------------2
	"分解战马，获取随机马魂", 						------------------3
	"获取兵符石，返还所有精炼材料", 				------------------4
	"选择后分解所有对应品质的%s",					------------------5
	"消耗碎片,合成",								------------------6
	"请先选择碎片",									------------------7
	"获得",											------------------8
	"攻击增加",										------------------9
	"兵力增加",										------------------10
	"物防增加",										------------------11
	"魔防增加",										------------------12
	"级",											------------------13
	"第%s次",										------------------14
	"服",											------------------15
	"已上阵",										------------------16
	"已装备",										------------------17
	"(拥有:%s)",									------------------18
	"基础",											------------------19
	"强化",											------------------20
	"所有数码兽(%s)",									------------------21
	"前排数码兽(%s)",									------------------22
	"中排数码兽(%s)",									------------------23
	"后排数码兽(%s)",									------------------24
	"商品已售罄",									------------------25
	"需要的碎片数量不足",							------------------26
	"包裹中没有对应的材料",							------------------27
	"升星成功",										------------------28
	"材料不足",										------------------29
	"进阶成功",										------------------30
	"需要激活所有星格",								------------------31
	"请输入角色名",									------------------32
	"没有可穿戴的装备",								------------------33
	"没有可以更换的装备",							------------------34
	"未穿戴装备",									------------------35
	"招募令不足",									------------------36
	"下次免费时间未到",								------------------37
	"兽魂不足",										------------------38
	"已达购买上限",									------------------39
	"数码兽受到的伤害减少%s%%，造成的伤害增加%s%%", 	------------------40
	"%s在%s发布了召集令,是否前往？",				------------------41
	"%s在据点【%s】将我击败",						------------------42
	"未入榜",										------------------43
	"购买气势值成功",									------------------44
	"请先参加势力战",									------------------45
	"复活CD时间中",									------------------46
	"交战中据点无法撤离",							------------------47
	"正在移动",										------------------48
	"荣誉值没有达到50",										------------------49
	"时间未到,不可领取",										------------------50	
	"无法离开交战中的据点，请使用据点中撤军功能",				------------------51	
	"据点状态已变更，无法前往",								------------------52	
	"不能进攻对方主城",										------------------53
	"时间已到",											------------------54
	"已领取",											------------------55
	"数码兽，您没有称谓",										------------------56
	"不能在主城号令"	,										------------------57
	"群魔乱舞，罗刹白莲围剿龙虎",											------------------58
	"天地色变，龙虎白莲决战罗刹",											------------------59
	"异军突起，龙虎罗刹奇袭白莲",											------------------60
	"玩家攻击了您，",											------------------61
	"您攻击了玩家",										------------------62
	"您获得了胜利！",										------------------63
	"是否确认加入龙虎门，加入该势力后将无法变更阵营",      -------------------64
	"是否确认加入罗刹教，加入该势力后将无法变更阵营",     -------------------65
	"是否确认加入白莲教，加入该势力后将无法变更阵营",      -------------------66
	"是否确认随机选择势力，选择后确认后将无法变成阵营",    -------------------67
	"据点没有被纵火，不可使用灭火",               ----------------68
	"开服五日后，势力战开启",                 ---------------69
	"气势值购买",           				      ---------------70
	"购买气势值",            				     ---------------71
	"获得气势值",            				     ---------------72
	"复活成功",            				     ---------------73
	"升级",           				----------------74
	"需要城堡达到%s级",				----------------75
	"需要用户达到%s级",				----------------76
	"%d/小时",          			----------------77
	"%d件/天",          			----------------78
	"钻石不足",          			----------------79
	"金币不足",          			----------------80
	"木材不足",          			----------------81
	"没有可以镶嵌的钻石",			----------------82
	"未选择任何钻石",				----------------83
	"[需要%s级兵营]",				----------------84
	"科技已到顶级",					----------------85
	"%02d时",						----------------86
	"%02d分",						----------------87
	"%02d秒",						----------------88
	"升级至%s%s级",					----------------89
	"冷却cd中",						----------------90
	"【城堡%s级开启】",				----------------91
	"无法携带更多的技能",			----------------92
	"无法装备更多同类型主公技",		----------------93
	"装备品级",						----------------94
	"强化等级",						----------------95
	"今日次数耗尽，提升VIP等级可获得更多次数",	----96
	"品级",							----------------97
	"2件",							----------------98
	"4件",							----------------99
	"6件",							----------------100
	"亲爱的玩家您好:",				----------------101
	"未入榜",						----------------102
	"伤害",							----------------103
	"排名",							----------------104
	"请先通过上一个副本",			----------------105钻石副本为开启提示
	"请先通过上一个难度",			----------------106钻石副本为开启提示
	"领主%s级开启",					----------------107钻石副本为开启提示
	"未开启",						----------------108
	"已经达到最高品质",				----------------109
	"损失铜币:%s",					----------------110
	"获得铜币:%s",					----------------111
	"无损失",						----------------112
	"抢夺失败",						----------------113
	"自己的不能抢",					----------------114
	"同阵营的不能抢",				----------------115
	"已经被抢光了",					----------------116
	"Lv.%s",						----------------117
	"第%s关",						----------------118
	"重置次数已用完",				----------------119
	"没有排名",						----------------120
	"请选择援军",					----------------121
	"%d万",							----------------122
	"请选择需要退化的数码兽",			----------------123
	"挑战次数不足",					----------------124
	"购买次数",						----------------125
	"总战力:",						----------------126
	"进度:",						----------------127
	"家族威望:",						----------------128
	"%s已经升级至%s级",				----------------129
	"是否花费%d钻石立即完成升级",		------------130
	"选择出售数量",					----------------131
	"选择使用数量",					----------------132
	"是否确定出售该物品",			----------------133
	"该boss已被击败",				----------------134
	"每日3:00自动重置",				----------------135
	"每日8:00至24:00开启",				------------136
	"周三、周六20:00-20:45开启",			------------137
	"剩余运送 %s/%s 掠夺 %s/%s",			------------138
	"今日已完成",					----------------139
	"军资正在运送中",				----------------140
	"今日运送次数已用完",				------------141
	"是否花费%d钻石，立即完成护送的当前军资？",	----142
	"可用于建筑和兵营科技升级",	--------------------143
	"需要先通关前置关卡",			----------------144
	"第%s名",				------------------------145
	"%s/小时",				------------------------146
	"购买次数已达上限",				----------------147
	"是否花费%s钻石购买一次挑战次数？",		--------148
	"扫%s次",				------------------------149
	"获得%s称号后可以挑战",			----------------150
	"累计%s天奖励",				--------------------151
	"【无】",				------------------------152
	"亲,请按指引操作哦",			--------------------153
	"VIP等级不足",				--------------------154
	"对",					------------------------155
	"造成伤害",					--------------------156
	"暂未加入公会",				--------------------157
	"升级队列已满",				--------------------158
	"%s--%s区",					--------------------159
	"%s件",						--------------------160
	"第%s关-第%s关",				--------------------161
	"今日攻打炼狱次数已用尽",		----------------162
	"升级至%s级%s",				--------------------163
	"请解除数码兽羁绊再进行分解",	--------------------164
	"会长或者副会长才能号令",	--------------------165
	"您没有加入公会",	----------------------------166
	"您的粮草不足",	--------------------------------167
	"您是否确定消耗%d粮草发布号令？",	----------------168
	"前往",							----------------169
	"领取",							----------------170
	[241]="恭喜充值成功",							----------------241【数码宝贝】限时好礼
}
pay_success_tip_info = {
	"恭喜购买%s成功！每日都可以领取免费钻石哟!",
}

choose_camp_tip_string = {
	"是否确认加入龙虎门，加入该势力后将无法变更阵营",      -------------------1
	"是否确认加入罗刹教，加入该势力后将无法变更阵营",     -------------------2
	"是否确认加入白莲教，加入该势力后将无法变更阵营",      -------------------3
	"是否确认随机选择势力，选择后确认后将无法变成阵营",    -------------------4
}

national_truce_dec =  --国战说明
{
	{"【规则】","势力战领地分为龙虎门领地、白莲教领地、罗刹教领地、中立区4个区域。"},
	{"","每个势力有一个主神像，主神像无法被攻陷，玩家阵亡时，会被传送至主神像复活。"},
	{"","杀死据点中最后一个NPC，则该玩家所属的势力视为占领据点的势力,活动期间已经被占领的据点可以继续被抢夺。"},
	{"","若同一个据点有超过两股以上的势力同时争夺，则在此据点范围内的玩家，既可以攻击守卫据点的NPC，也可以攻击正在攻击据点的其他势力玩家。"},
	{"","不论攻守双方人数差距多大，占领据点的条件永远是“击杀该据点最后一个守卫据点的NPC”，一旦据点易主，将清空该据点内所有其他势力的玩家，这些玩家将被强制传送回主神像。"},
	{"","当满足一定条件时，玩家可以选择进行一些战术移动，如突进、包围等。"},
	{"","势力战结束时，占领据点最多的势力视为势力战的最终胜利势力。"},
	{"","势力战结束时，占领据点最多的势力视为势力战的最终胜利势力。"},
	{"【战斗】","【等待】当玩家进入某领地后，自动进入等待状态，等待状态下可以被敌方玩家匹配到，匹配到后进入战斗。"},
	{"","【寻敌】点击攻击后，进入主动匹配敌方目标状态，每次点击攻击后会有10秒的攻击冷却时间。攻击可以选择特定势力的玩家进行攻击。"},
	{"","【战斗】寻敌模式下，胜利后会有增加30秒的CD时间，当时间累积到1分钟后，进入冷却状态，冷却状态下不可主动攻击，花费200气势值可以清除CD。战斗胜利后，玩家的数码兽不会回复已损失的血量，但怒气会重置。"},
	{"","【阵亡】战斗失败后，进入阵亡状态，阵亡状态下，不可进行指令相关操作。"},
	{"","【复活】阵亡后，传送回主神像等待1分钟的复活CD，可以花费500气势值立即复活。"},
	{"","【撤退】玩家可以花费200点气势值和损失最大生命值20%的生命为代价，强行从交战中的领地中撤退。"},
	{"","【突进】进攻人数高于防守人数两倍时，可采取突进战术。"},
	{"","【包围】当一个据点周围的据点被其他势力占领时，该据点内防守方造成伤害降低50%、承受伤害增加50%。"},
	{"","【召集】武神、战神、和斗神可发布召集令，号令本势力成员迅速集合攻打目标据点。"},
	{"","【扶弱】势力战获得第二名，下次势力战增加1500气势值，获得第三名，下次势力战增加3000气势值。"},
	{"","【同盟】当一个势力连续两次获得势力战第一，或同一个势力连续两次获得势力战第三，上次势力战的二、三名自动结盟。"},
	{"","【盟约】势力战结算时，同盟两势力的据点数和总荣誉将相加进行排名，击杀同盟势力的玩家的个人荣誉减半。"},
	{"【奖励】","荣誉值少于50点的玩家无法领取任务奖励。"},
	{"","势力战结束时，会给据势力所占领地数量的排行，给与势力战中获得50点荣誉以上的本玩家一定的奖励，排名不同，奖励不同。"},
	{"","势力战结束时，跟根据个人在本荣誉排行中的位置，给与一定的奖励 。"},
}

red_alert_hero_camp = 
{
    "龙虎门",
    "罗刹教",
    "白莲教",
    "中立",
}

red_alert_officer = 
{
	"【武神】",
    "【战神】",
    "【斗神】",
    "【三品】",
	"【四品】",
    "【五品】",
    "【六品】",
    "【七品】",
    "【八品】",
    "【九品】",
}

red_alert_family_officer = 
{
	"【会长】",
    "【副会长】",
    "【成员】",
}

red_alert_home_city_id = 
{
	1,
    62,
    28,
}

red_alert_resouce_tip = 
{
	{"战神令","势力中获得的独有资源"},
	{"气势值","势力战复活、清除CD需要的资源"},
}
red_alert_war_city_map_tip = 
{
	"没有敌方目标",
	"cd时间未到",
	"清除战斗cd需要%d气势值",
	"当前据点处于火攻状态下，守方攻击下降%d。",
	"当前据点未处于火攻状态下。",
	"攻击方无法使用",
	"守城方无法使用",
}


---------------------红装技能和天赋
_equip_red_tip = {
	"（精炼至%d阶开启）", -----------------------------------------1
}

tipStringInfo_treasure_seat_str = {
	"[攻击]", -------------------------------------------1
	"[防御]", -------------------------------------------2
	"装备于", -------------------------------------------3
	"已装备", -------------------------------------------4
}
--------------------红装技能天赋激活颜色配置
red_equip_skill_color_type = {
	{0,0,0},		--未激活
	{255,0,0},		--激活
}

---------------------装备升星
_equip_up_star_tip = {
	"不可升星",
	"已满星",
	"升至%d星属性",
	"高",
	"较高",
	"一般",
	"(每日0时清零)",
	"升星成功",
	"升星失败",
	"幸运值",
	"暴击1.5倍",
	"大暴击2倍",
	"经验值",
}
---------------------限时优惠、月基金、限时团购配置
_activity_new_tip_string_info = {
	"折",-------------------------------1
	"进度满了之后才可获得充值优惠！",------------------2
	"已购买",---------3new
	"购买人数达到%d购买",----------4
	"充值成功！恭喜获得充值优惠，额外获得%d钻石！",--------------------5
	"购买进度",--------------------6
	"购买成功！",---------------7
	"成功购买",---------------8
	"购买",---------------9
}

---------------------限时优惠颜色
_activity_limit_color = {
	{255,255,255},----------1白色
	{0,200,255},-----2 蓝色
	{255,73,30},-----------3红色
	{255,255,30},-----------4黄色
}

--------------------新数码的文字--------------------------
_new_interface_text = {
	"等级达到%d级",							--1
	"星级达到%d级",							--2
	"达成条件后,完成指定关卡即可进化~",		--3
	"进化副本",								--4
	"%d级",									--5
	"需求等级%d",							--6
	"%d星解锁",								--7
	"Exp+%d",								--8
	"剩余技能点数:%d(%s)",					--9
	"确认要出售%s吗?",						--10
	"出售成功!",							--11
	"(今日已用%d/%d)",						--12
	"查看详情",								--13
	"关闭详情",								--14
	"该数码兽的初始获取形态为%s",			--15
	"本次免费",								--16
	"%s个%s碎片",							--17
	"技能点已满",							--18
	"技能等级无法超过数码兽等级",			--19
	"你是vip%d,今日还可购买%d次",			--20
	"购买%d技能点需",						--21
	"今日购买次数已用完",					--22
	"提升VIP等级可增加购买次数",			--23
	"购买技能点",							--24
	"拖动可选择转换数量:%d/%d", 			--25
	"没有万能碎片,无法转化",				--26
	"材料不足",							--27
	"金币不足",							--28
	"等级不足",							--29
	"Lv",									--30
	"请选择升级材料",						--31
	"数码兽等级不能超过战队等级,请努力提高战队等级", --32
	"通关",			---------------------------33//副本关卡宝箱名称，中间取金色
	"可领取",			---------------------------34//副本关卡宝箱名称，中间取金色
	"该关卡尚未开启！",			-------------------35//跳转提示
	"第%d战",			-------------------36//扫荡提示
	"无奖励可领取~",						--37
	"来自公会:",						--38
	"排名达到%d",						--39
	"努力提升排名才能领取哦！",			--40
	"膜拜成功，获得%d金币！",			--41
	"保持当前排名（第%d名到第%d名），即可获得以下奖励：",			--42
	"第%d名",			--43
	"公会名称中不能含有特殊字符",			--44
	"公会公告中不能含有特殊字符",			--45
	"V%d",				--46
	"今日",				--47
	"%d天之前",			--48
	"点击输入玩家名称", --49
	"昨日",				--50
	"确认删除该好友吗？", --51
	"体力领取成功",			--52
	"没有可赠送的好友",		--53
	"体力赠送成功",			--54
	"发送申请成功",			--55
	"成功添加该好友",		--56
	"已全部拒绝",			--57
	"该公会拒绝任何人加入！",			--58
	"您的等级未达到该公会要求等级！",			--59
	"成功加入公会，快去看看吧！",			--60
	"会长:%s",			--61
	"公会%d级开启",			--62
	"今日次数已用尽,明天记得来做贡献哦！",			--63
	"%d宝石解锁",			--64
	"%d等级解锁",			--65
	"最多输入%d个字",		--66
	"没有奖励可领取",		--67
	"请选择私聊对象",		--68
	"无人可加速",			--69
	"%d个加鲁鲁兽",			--70
	"第%d名及以后",			--71
	"阵容保存成功",			--72
	"全属性加成:%d",		--73
	"公告",					--74
	"获得",					--75
	"红包发放成功,快喊小伙伴们抢夺吧！",					--76
	"%s的红包",					--77
	"你抢到了%s的红包,获得%s",					--78
	"vip%d双倍",					--79
	"%|4|购买%!x@%|4|件:%",				--80
	"当日奖励已领取|升级至%|2|vip%d%可领取",				--81
	"累计充值|%d|钻石送:%d/%d",				--82
	"另赠%d钻(仅首次)",			--83
	"V%d特权",					--84
	"V%d%s超值礼包包含以下内容:", 	--85
	"(首充)",					--86
	"当日奖励已领取!升级至|%s|可补领VIP双倍的奖励", 	--87
	"%s后开启", 	--88【数码宝贝】开服狂欢
	"(今日已用%d/%d)", 	--89
	"战力需达到%d发放排名奖励", 	--90
	"加入公会后开启公会商店",		--91
	"购买成功，欢迎再来！",			--92
	"%s不足",			--93
	"公会币",						--94
	"试炼币",						--95
	"竞技币",							--96
	"件",							--97
	"（今天还有%d次刷新机会）",		--98
	"今日刷新次数已用完",			--99
	"今天%d点",						--100
	"明天%d点",						--101
	"下次自动刷新时间：",			--102
	"等级:",						--103
	"公会:",						--104
	"这家伙很懒，什么也没有说",		--105
	"名字修改成功",					--106
	"请输入新的昵称哟~",			--107
	"请输入文字",					--108
	"昵称不能超过6个字符！",					--109
	"您暂时还有加入公会哦~",		--110
	"个性签名不能超过%d个字，请修改~",	--111
	"修改成功",						--112
	"暂未开启",						--113
	"需要输入10位！",				--114
	"获得%s",					--115
	"等 级:",						--116
	"当前未上榜,无法获得排名奖励",						--117
	"积分达到%d",						--118
	"队伍已满~",					--119
	"%%|4|%s%%被黑色齿轮控制了，快来一起打败黑暗力量！",	--120
	"邀请发送成功",					--121
	"发送邀请过快，请稍等",			--122
	"您需要拥有对应数码兽才能挑战~",--123
	"您已经在净化数码兽队伍内了",	--124
	"加入成功快去净化数码兽吧~",	--125
	"有未购买的BUFF,是否退出?",		--126
	"通关副本后才可领取",			--127
	"比赛开始后无法查看昨日回顾~",	--128
	"%s碎片",						--129
	"每周一、三、五、日开放",		--130
	"每周二、四、六、日开放",		--131
	"需通关上一关且等级达到%d级才能解锁哦~",	--132
	"满星才能扫荡~",				--133
	"暂无可以一键膜拜的对象~",		--134
	"扫荡%d次",		--135
	"扫%d次",		--136
	"原技能",		--137
	"新技能",		--138
	"1.通过",		--139
	"2.通过",		--140
	"精英关卡",		--141
	"主线关卡",		--142
	"请先上阵数码兽~",		--143
	"%d级开启",		--144
	"天赋树共消耗天赋点%d",			--145
	"解锁条件：第%s个天赋树中投入%d点天赋点，战队等级达到%d级",			--146
	"所属天赋树解锁",		--147
	"战队等级达到%d级",		--148
	"%s达到%d(%d/%d)",		--149
	"数码精神·%s",		--150
	"您还没有报名呦~",		--151
	"上阵数码兽不足，详细请见规则说明",		--152
	"王者之战已结束，您获得了%d胜%d负，未能晋级下一轮",		--153
	"虚位以待",		--154
	"%d胜%d负",		--155
	"暂无",		--156
	"第%d名到第%d名",		--157
	"数码兽达到 紫%s品质解锁",		--158
	"数码兽达到 橙%s品质解锁",		--159
	"未添加材料",		--160
	"直接将%s提升至LV.%s",		--161
	"请添加材料~",		--162
	"需要达到战队等级%d",		--163
	"已经有公会",		--164
	"申请成功",		--165
    "锤子不足，每充值60钻石可以获得一把锤子~",		--166
    "恭喜玩家%|4|!x@%在砸金蛋活动中获得%|4|!y@!z@!a@%",		--167
    "(%s倍金蛋奖励)",		--168
	"请勿在10s重复发送",		--169
	"您尚未获得该数码兽",		--170
    "%d星",                      -- 171
    "请先使用免费次数",                      -- 172
	"剩余星数不足",		--173
    "您未使用天赋点，不乱收费~",		--174
    "您没有该礼物哦~",		--175
    "竞技币可在竞技场中获得",		--176
    "试炼币可在数码试炼中获得",		--177
    "挑战次数已经用光！",		--178
    "是否全部送给%s",		--179
    "报名成功",		--180
    "报名时间：10:00-19:50",		--181
    "开始时间：20:00",		--182
	"生命值提升%d点",		--183
	"生命值+%d%%",		--184
	"免疫率+%d%%",		--185
	"攻击力提升%d点",		--186
	"攻击力+%d%%",		--187
	"伤害率+%d%%",		--188
    "装备碎片",		--189
    "开始游戏",		--190
    "再来一次",		--191
    "感谢您的帮助，送您%s金币",		--192
    "兑换道具不足",		--193
    "您今日的加速次数已用完",		--194
	"更换公会后，明天才能玩哦~",		--195
	"开服第%d天开启",		--196
    "今日次数已用完！",		--197
	"领奖",		--198
	"已领取",		--199
	"王者之战已结束，您获得了%d胜%d负，未能晋级下一轮",		--200
	"%d胜%d负",		--201
	"无人下注",		--202
    "该玩家今日加速次数已用完，请为其他玩家加速~",		--203
    "竞技币可通过竞技场获得",		--204
    "试炼币可通过数码试炼获得",		--205
	"请输入邮件内容！",				--206
	"邮件发送成功",				--207
	"请输入要发送的内容",---------208
	"今日发送邮件次数已达上限",---------209
	"重置关卡次数需要花费：%d宝石。确定重置吗？（今日已重置%d次）",---------210
	"今日已达到重置上限",---------211
    "完成战斗%s/%s",---------212
	"请升级激活天赋属性",------213
	"天赋树总共消耗天赋点%d",------214
	"等级已达上限",------215
    "%d连胜",------216
    "%d分",------217
    "%d胜",------218
    "第%d天",------219
    "升级成功",------220
    "您已经被淘汰",------221
    "当前:王者之战第%d场比赛正在展示中",------222
    "需要达到%d级才能开启下一章节",------223
	"货物还在准备中，敬请期待",------224
	"仅限%s人购买(剩余)%s件",------225
	"需要达到vip%s才能购买",------226
	"仍有宝箱可以开放，确定跳过吗？",---------227
	"%d层剩余",						---------228
	"经验超出上限",						---------229
	"选择材料数量过多",						---------230
	"当前没有任何BUFF",						---------231
	"更新提示",						---------232
	"有新的版本内容需要更新,请前往更新.",						---------233
	"服务器重置提示",						---------234
	"新的一天正在装载中",						---------235
	"上阵",						---------236
	"合成",						---------237
	"阵容保存成功",						---------238
	"升级的同时品质将自动提升到",			---------239
	"升级条件不足",			---------240
	"没有选择材料",			---------241
	"V%d特权礼包",			---------242
	"确定放弃跳过战斗??",			---------243
	"数码兽等级无法超过战队等级",			---------244
	"（每日活动）",			---------245
	"试炼币不足",			---------246
	"领取",			---------247
	"神兽来袭",			---------248
	"神兽来袭2选1",			---------249
	"确认选择%s吗？",			---------250
	"数码兽需达到紫色以上品质才可以阶数还原",			---------251
	"所有技能级数和需达到%d才可以技能还原",			---------252
	"所有斗魂级数和需达到%d才可以斗魂还原",			---------253
	"数码兽等级需达到%d才可以经验还原",			---------254
	"前四件装备等级之和大于%d才能进行装备重生",			---------255
	"该道具尚未进行提升，无需还原",			---------256
	"至少需要一件装备拥有星级",			---------257
	"缺少重生石",					--------------258
	"还原数码兽%s%s，可以返还以下道具：",		------------259
	"的阶数",		------------260
	"的技能等级",		------------261
	"的斗魂等级",		------------262
	"的等级",		------------263
	"的装备等级和阶数",		------------264
	"的神圣计划等级",		------------265
	"的指环等级",		------------266
	"所有装备的星级",		------------267
	"阶数还原",		------------268
	"技能还原",		------------269
	"斗魂还原",		------------270
	"经验还原",		------------271
	"装备品质还原",		------------272
	"神圣计划还原",		------------273
	"指环还原",		------------274
	"装备觉醒还原",		------------275
	"选择",		------------276
	"将数码兽%s%s还原至初始状态，是否继续？",		------------277
	"返还%s的材料，",		------------278
	"普通重生",		------------279
	"x%s（拥有：%s）",------------280
	"数码兽等级需达到%d级",------------281
	"装备降星",------------282
	"装备降星需消耗",------------283
	"降星返还所有觉醒材料,确定使用吗?",------------284
	"请先解锁上一神器",------------285
	"解锁成功",------------286
	"累积活跃度达到%s，可领取以下奖励：",			--287
	"没有奖励可领取",			--288
	"已达体力上限",			--289
	"进阶成功",			--290
	"VIP等级越高，暴击倍率越高",			--291
	"（每日前十次点金双倍）",			--292
	"您现在没有加入任何公会",			--293
	"公会等级不足，公会3级开启能量屋",			--294
	"您的材料不足，已为您培养了%d次~",			--295
	"通关 %s 后开启下一章",			--296
	"暂未开启下一章",			--297
	"后可领取",			--298
	"终极奖励仅能领取1次，领取后不可再领，\r\n  （推荐完成度100%时领取最高奖励！）",			--299
	"是否花费%d宝石开启多次宝箱？",		--300
	"该频道为组队频道不能发言",			--301
	"当前等级:%s",			--302
	"战队等级达到%s可领取奖励",			--303
	"点赞成功，%s人气值+1",			--304
	"您的数码兽状态都很好，无数码兽可供选择",			--305
	"联动玩家只可登陆特殊的服务器，请重新选择登陆",			--306
	[307] = "另赠%d钻",			--307二充及每次额外赠送，若为0不显示
	[308] = "发送申请成功",			--308找回密码发送邮件成功
	[309] = "!x@折",			--309
}


activity_tip_str_info = {
	"每天充值都会有好礼相送哦",		--1
	"今日已充值%d钻石,再充%d钻石即可领取",	--2
	"未达到充值条件哦~",			--3
	"需进度达到:%d%%",				--4
}

activity_recruit_ship_str = {
	{	
		"%|4|技之王者，强力输出%",
		"可启动%|4|亚古兽、大耳兽%的缘分",
		"输出强力，最佳搭档，你值得拥有",
		"必杀：兽王拳，用正义制裁你",
	},
	{
		"快速回复%|4|怒气、全屏%攻击",
		"可启动%|4|哥玛兽、巴鲁兽%的缘分",
		"觉醒后和亚古兽组成双重火焰，燃烧吧~",
		"任意充值即可获得，全屏秒杀脆皮敌人",
	},
	{	
		"%|4|solo之王，最强单挑数码兽%",
		"可启动%|4|亚古兽、九尾狐兽%的缘分",
		"最强的进攻就是最好的防守，加鲁鲁兽——最强之矛！",
		"V12玩家可购买礼包获得，加鲁鲁兽不会令你失望。"
	},
}

skill_attributes_text_tips = {
	"生命",	--1
	"攻击",	--2
	"防御",	--3
	"灵防",	--4
	"生命",	--5    	%
	"攻击",	--6		%
	"防御",	--7		%
	"灵防",	--8		%
	"暴击率",	--9			%
	"抗暴率",	--10		%
	"格挡率",	--11		%
	"破击率",	--12		%
	"命中率",	--13		%
	"闪避率",	--14		%
	"物理免伤",	--15		%
	"灵压免伤",	--16		%
	"治疗率增加",	--17		%
	"被治疗率增加",	--18		%
	"最终伤害",	--19
	"最终减伤",	--20
	"初始怒气",	--21
	"体质",	--22
	"力量",	--23
	"灵力",	--24
	"物理攻击",	--25
	"额外伤害",	--26
	"治疗值",	--27
	"被治疗值",	--28
	"灼烧伤害",	--29
	"中毒伤害",	--30
	"灼烧免伤",	--31
	"中毒免伤",	--32
	"经验",	--33
	"伤害加成",	--34		%
	"伤害减免",	--35		%
	"PVP终伤",	--36		%
	"PVP免伤",	--37		%
	"初始合击点数",	--38
	"每次出手增加的怒气",	--39
	"灼烧伤害",	--40		%
	"吸血率",	--41		%
	"怒气",	--42
	"反弹率",	--43		%
	"暴击强度",	--44		%
	"免控率",	--45		%
	"小技能触发概率",	--46		%
	"格挡强度",	--47		%
	"控制率",	--48		%
	"治疗效果",	--49		%
	"——",	--50		%
	"数码兽类型克制伤害",	--51		%
	"溅射伤害",	--52		%
	"技能伤害",	--53		%
	"被治疗率减少",	--54		%
	"伤害提升",	--55		%
	"必杀伤害率",	--56		%
	"增加造成的必杀伤害",	--57		%
	"减少造成的必杀伤害",	--58		%
	"增加暴击伤害",	--59		%
	"减少暴击伤害",	--60		%
	"受到的必杀伤害增加",	--61		%
	"怒气回复速度",	--62		%
	"受到伤害降低",	--63		%
	"降低攻击",	--64		%
	"降低防御",	--65
	"伤害加成百分比提升",	--66		%
	"降低必杀伤害率",	--67		%
	"降低伤害减免",	--68		%
	"降低防御",	--69		%
	"降低怒气回复速度",	--70		%
	"数码兽类型克制伤害加成",	--71		%
	"数码兽类型克制伤害减免",	--72		%
	"降低攻击",	--73
	"必杀抗性",	--74		%
	"减少必杀抗性",	--75		%
	"降低免控率",	--76		%
	"复活概率",	--77		%
	"被复活概率",	--78		%
	"复活继承血量",	--79		%
	"复活继承怒气",	--80		%
	"被复活继承血量",	--81		%
	"被复活继承怒气",	--82		%
	"增加复活概率",	--83		%
	"增加复活继承血量",	--84		%
}

cultivate_spirit_attributes_name = {
	"暴击率",
	"抗暴率",
	"伤害率",
	"免伤率",
	"格挡率",
	"破挡率",
	"攻击",
	"防御",
	"生命",
}
union_red_envelopes_tips = {
	"金币",
	"钻石",
	"神器之魂",
}

union_job_title = {
	"会长",
	"副会长",
	"会员",
	"升职成功", --4
	"降职成功", --5
    "确认踢出该成员？",		--6
    "确认把会长转交给 %s？您的职位将与对方对换",		--7
}
-------------公会科技捐献说明
union_science_text = {
	"通过扭蛋形式可抽取道具，当6个道具均为加鲁鲁兽时，可获得一个加鲁鲁兽碎片",
	"提升等级可提高玩法次数和免费改投次数",
	"在堕天地狱兽大冒险中，通关的层数越多，奖励越高",
	"升级后可增加玩法次数和获得金币上限",
	"在公会红包中会员不仅可以抢系统红包，还可以分享红包给朋友们哦！",
	"可增加红包里包含的金币、钻石数量",
	"科技是第一生产力",
	"升级科技可额外提高公会成员上限",
}

union_limit_title = {
	"允许任何人加入",
	"需要申请才能加入",
	"禁止任何人加入",
	"无限制",
}
skill_quality_text = {
	"技能攻击",
	"必杀技",
	"被动技能",
}

equip_tips_text = {
	"快速添加",
	"一键升级",
}

---------------资源类型对应的图标,品质框调用
_props_image_name = {
	"4002,2",--	1:金币
	"4001,2",--	2:钻石
	"4007,2",--	3:竞技币
	"",--	4:将魂
	"",--	5:魂玉
	"",--	6:道具
	"",--	7:装备
	"4006,2",--	8:战队经验
	"",--	9:耐力
	"",--	10:功能点开启
	"",--	11:上阵人数
	"4005,2",--	12:体力
	"",--	13:数码兽
	"",--	14:竞技场排名
	"",--	15:伤害类型
	"",--	16:比武积分
	"",--	17:霸气
	"4006,2",--	18:试炼币
	"",--	19:日常任务积分
	"",--	20:叛军中的功勋
	"",--	21:叛军中的战功
	"",--	22:日常副本基础奖励
	"",--	23:日常副本额外奖励
	"",--	24:叛军中的出击令
	"",--	25:免战时间
	"",--	26:成就积分
	"",--	27:？
	"4013,2",--	28:公会币
	"",--	29:排位赛胜点
	"",--	30:排位赛积分
	"",--	31:国战的战功令
	"",--	32:魔陷卡
	"",--	33:驯兽魂
	"4008,2",--	34:天赋点
	"4009,2",--	35:探索币
	"",--	36:矿石
	"",--	37:？
	"",--	38:？
	"4039,4",--	39:VIP经验
}

_reward_image_name = {
	"4002",--	1:金币
	"4001",--	2:钻石
	"4004",--	3:竞技币
	"4007",--	4:将魂
	"4008",--	5:兽魂
	"4006",--	6:荣誉
	"4005",--	7:体力
	"3017",--	8:精力
	"4005",--	9:战功
}

---------------------品质对应颜色
_quality_color = {
	{255,255,255},----------0白色
	{0,255,0},--------------1绿色
	{0,255,255},------------2蓝色
	{255,0,255},------------3紫色
	{243,152,0},------------4橙色
	{255,0,0},--------------5红色
	{255,255,0},------------6金色
}

--富文本颜色
chat_rich_text_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R10 G242 B32
	cc.c3b(10, 207, 242),				-----------------3 品质蓝 R10 G207 B242
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R222 G70 B204
	cc.c3b(204, 197, 11),			---------------------5 品质橙 R204 G197 B11
	cc.c3b(239, 22, 22),				-----------------6 品质红 R239 G22 B22
	cc.c3b(98, 55, 0),				---------------------7 品质褐 R98 G55 B0
	cc.c3b(0, 0, 0),				---------------------8 品质黑 R0 G0 B0
}
--小助手颜色
chat_rich_text_two_color = {
	cc.c3b(180, 180, 180),			---------------------1 品质白 R180 G180 B180
	cc.c3b(10, 242, 32),			---------------------2 品质绿 R69 G250 B133
	cc.c3b(10, 207, 242),				---------------------3 品质蓝 R69 G244 B250
	cc.c3b(222, 70, 204),			---------------------4 品质紫 R214 G72 B255
	cc.c3b(255, 138, 0),			---------------------5 品质橙 R255 G142 B42
	cc.c3b(239, 22, 22),				---------------------6 品质红 R255 G44 B34
}

--羁绊颜色
the_color_of_the_fetters = {
	cc.c3b(154,154,154),					--1 缘分未激活颜色
	cc.c3b(50,255,255),					--2 缘分激活颜色
	cc.c3b(144,144,144),					--3 缘分未激活颜色内
	cc.c3b(255,215,0),					--4 缘分激活颜色内
}
activity_add_energy_tips = {
	"早餐体力(%s)",
	"午餐体力(%s)",
	"晚餐体力(%s)",
	"夜宵体力(%s)",
}

---------------------月卡、体力等任务的配置
_daily_mission_param = {
	{"4002","月卡","累充25元,可领取100钻石/天,持续31天|,(剩余%d天)","2-0,100"},----------25元月卡
	{"4002","至尊月卡","累充88元,可领取100钻石/天,持续31天|,(剩余%d天)","2-0,100"},----------88元月卡
	{"4005","领取60点体力","早餐体力(%s)","3-0,60"},
	{"4005","领取60点体力","午餐体力(%s)","3-0,60"},
	{"4005","领取60点体力","晚餐体力(%s)","3-0,60"},
	{"4005","领取60点体力","夜宵体力(%s)","3-0,60"},
}


------全服战力排行活动规则
_activity_full_service_rankings_tips = {
	"活动开启时间为%s,奖励发放依据为活动开启后第5日21:30战力排行榜排名(通过邮件发放)!",
	"%s根据战力,可以获得战力达标奖励(达标奖励按照最高战力发放，不累计)",
	"战力相同,按照排名时间先后排序",
	"1-10名排名奖励需要达到%s战力值",
	"%s战斗力排行榜前10玩家有丰厚奖励哦!",
	"达到指定战力就有额外好礼哦(%s按照最高战力结算发放)",
}

_activity_full_service_times_tips = {
	"年",		--1
	"月",		--2
	"日",		--3
	"点",		--4
	"早",		--5
	"中",		--6
	"晚",		--7
}

--背景图名称
_back_groud_image_name = {
	"默认场景",
	"绿野仙踪",
	"夜歌森林",
}
--功能开启文字 
_model_open_push_tip = {
	{15,"达到15级即可出征竞技场，开启数码世界新篇章~"},		--1
	{18,"18级开启金币副本，实力越强，金币越多~"},		--2
	{20,"20级开启公会，与战友一起共谋天下~"},			--3
	{24,"达到24级可以挑战数码试炼，高层的难度与奖励都会让你窒息~"},			--4
	{26,"26级开启装备觉醒，激活装备的隐藏能量~"},			--5
	{28,"28级开放，大大增强数码兽属性，让你的敌人闻风丧胆~"},		--6
	{36,"36级开启数码精神，与数码兽的关系越亲密，数码兽的能力越强大~"},			--7
	{40,"40级开放斗魂，数码兽潜力大开发~"},			--8
	{47,"47级开启神器，神器加成可作用于所有数码兽哦~"},			--9
	{79,"高等级的世界等待你的加入~"},			--10
	{56,"56级开启数码重生，返还初始数码兽及全部养成资源！"},			--11
	{64,"64级开启活跃度，完成指定任务即可领取奖励！"},			--12
}

-- 砸金蛋规则说明
_activity_smoked_eggs_rule_tips = {
    "1.活动期间，每累计充值6元时，可获得一个砸金蛋的锤子。每日最多可获得10个锤子\r\n\r\n2.只要30000金币和1个锤子，即可进行一次砸金蛋。每次砸蛋有几率出现3倍、6倍、10倍的奖励，对应奖励为90000、180000、300000金币。\r\n\r\n3.只要出现10倍奖励，即重置3个金蛋；若未砸中10倍奖励，可继续砸剩余的金蛋，直至砸中。\r\n\r\n4.如果运气好，第一次就可以砸中10倍奖励；如果运气差，3次至少也出1次10倍奖励。",
    "1.活动期间，每累计充值6元时，可获得一个砸金蛋的锤子。每日最多可获得10个锤子\r\n\r\n2.只要10钻石和1个锤子，即可进行一次砸金蛋。每次砸蛋有几率出现3倍、6倍、10倍的奖励，对应奖励为30、60、100钻石。\r\n\r\n3.只要出现10倍奖励，即重置3个金蛋；若未砸中10倍奖励，可继续砸剩余的金蛋，直至砸中。\r\n\r\n4.如果运气好，第一次就可以砸中10倍奖励；如果运气差，3次至少也出1次10倍奖励。",
}

game_share_tip_text = {
	"分享成功",
	"加入公会才可使用",
	"发送成功",
	"当前没有公告",
}

login_gift_reward_info = {
	"连续登录送大耳兽",
	"连续登录送大耳兽",
	"连续登录送艾力兽",
	"连续登录送亚古拉兽",
}

login_gift_reward_role_info = {
	"44",
	"44",
	"51",
	"37",
}

--公会战排行前三名颜色
union_fighting_rank_text_color = {
	{255, 158, 0},      -- 1
	{244, 0, 255},          -- 2
	{0, 203, 255},        -- 3
}

--王者之战的战斗推送文字
battle_of_kings_push_text = {
	"%|5|!x@%不敌%|2|!y@%,遗憾落败",
	"%|2|!x@%英勇无敌,战胜%|5|!y@%,获得%|1|!z@%积分,成功晋级",
	"%|2|!x@%打败%|5|!y@%,获得%|1|!z@%积分,成功晋级",
	"%|4|!x@%千钧一发,险胜%|5|!y@%,获得%|1|!z@%积分,成功晋级",
	"您已成功报名,预祝您征战顺利!",
	"预选赛第%d场!",
	"巅峰对决",
	"您已经被淘汰",
}

--招募的预览的对应颜色
recruit_preview_tip_color = {
	{255,255,255},				--0白
	{36,156,31},					--1绿
	{0,115,169},				--2蓝
	{255,0,255},				--3紫
	{255, 150, 0},				--4橙
	{255,0,0},					--5红
	{255,255,0},				--6金
}

home_activity_push_times_info = {
	{"145", {"19:01:00", "20:01:00", "22:01:00", "24:01:00", "03:01:00", "05:01:00"}},		-- 公会红包
	{"82", {"10:01:00", "12:01:00", "15:01:00", "17:01:00","19:01:00","20:01:00" }},					-- 公会战
	{"93", {"12:01:00", "15:01:00", "17:01:00","19:01:00","20:01:00", "22:01:00", "24:01:00", "03:01:00", "05:01:00"}},	-- 数码净化
	{"81", {"10:01:00", "12:01:00", "15:01:00", "17:01:00","19:01:00", "20:01:00", "20:55:00"}},								-- 王者之战
}

--公会小游戏配置
union_small_games_deploy = {
	"100604",
}

account_sys_manager_tips = {
	"登陆成功!",
	"注销成功!",
	"密码修改成功!",
	"长度小于6个字符!",
	"长度大于18个字符!",
	"2次密码不正确!",
	"内容包含特殊字符!",
	"内容不可为空!",
	"账号",
	"密码",
}

------------【数码宝贝】征战按钮上方气泡内容，格式：NPCid,文字内容
home_duplicate_tips_info = {
	{"3", "恶魔兽就在无限山！"},
	{"5", "进化链可以进化数码兽"},
	{"6", "新剧情解锁啦！"},
	{"7", "这里掉落数码晶石！"},
	{"9", "主线2-6美美前方唱歌高能"},
	{"11", "主线2-8解锁强力装备"},
	{"14", "主线3-3可开启日常任务"},
	{"17", "主线3-6天女兽觉醒参战！"},
	{"19", "主线3-8魔王即将复活！"},
	{"23", "精英掉落装备卷轴"},
	{"27", "主线4-8奥米加兽火速赶往战场"},
	{"32", "觉醒装备快速提升战力"},
	{"37", "这里掉落数码兽碎片！"},
	{"47", "升星可以快速提升战力"},
	{"487", "有新剧情，奖励多多"},
}
------------【数码宝贝】主线npc战斗失败，未首充的玩家返回副本界面时必定弹出首充弹窗，如果跳转到养成界面则不弹出。（可任意删减）
battle_fail_show_frist_recharge = {
	"6",-----主线2-3
	"8",-----主线2-5
	"10",----主线2-7
	"12",----主线3-1
	"15",----主线3-4
	"16",----主线3-5
	"17",----主线3-6
	"18",----主线3-7
	"20",----主线4-1
	"21",----主线4-2
	"22",----主线4-3
	"23",----主线4-4
	"24",----主线4-5
	"25",----主线4-6
	"26",----主线4-7
	"27",----主线4-8
	"28",----主线5-1
	"29",----主线5-2
	"30",----主线5-3
	"31",----主线5-4
	"32",----主线5-5
	"33",----主线5-6
	"34",----主线5-7
	"35",----主线5-8
	"36",----主线5-9
	"37",----主线5-10
	"38",----主线6-1
	"39",----主线6-2
	"40",----主线6-3
	"41",----主线6-4
	"42",----主线6-5
	"43",----主线6-6
	"44",----主线6-7
	"45",----主线6-8
	"46",----主线6-9
	"47",----主线6-10
}
------------【数码宝贝】称号功能邮件提示替换文字
_title_param_mail = {
	"竞技场",---类型1
	"王者之战",---类型2
	"驯兽榜",---类型3
	"关卡榜",---类型4
	"冠军",
	"亚军",
	"季军",
	"无称号",---无称号按钮
}

--【数码宝贝TW】网页跳转（如果需要隐藏直接删除相应配置即可）
_web_page_jump = {
	[1] = "https://www.facebook.com/DM2TW/", --FB粉丝团
	[2] = "http://www.cayenneark.com.tw/info.aspx?G=20171013", --官方网站
	[3] = "http://www.cayenneark.com.tw/mobile/app_service/service_login.aspx?srv=20171013&T=1", --客服中心
	[4] = "https://itunes.apple.com/tw/app/tw.com.cayenneark.ask/id1367360357", --APP评价
	[5] = "http://www.cayenneark.com.tw/mobile/ctc/pay_login.aspx?srv=20171013", --第三方充值入口
	[6] = "https://play.google.com/store/apps/details?id=tw.com.cayenneark.dm2", --GOOGLE评价
}

--【火影】FB分享跳转地址
_web_page_share = {
	[1] = "https://itunes.apple.com/us/app/ultimate-ninja-ninja-king/id1352874290?l=zh&ls=1&mt=8", --IOS的FB分享
	[2] = "https://itunes.apple.com/us/app/ultimate-ninja-ninja-king/id1352874290?l=zh&ls=1&mt=8", --安卓的FB分享（临时网址）
}

--【数码宝贝】皮肤解锁
tipStringInfo_evolution_status = {
	[0] = "幼年期",
	[1] = "成长期",
	[2] = "成熟期",
	[3] = "完全体",
	[4] = "究极体",
}
--【数码宝贝】皮肤解锁
tipStringInfo_evolution_status_tips = {
	"到达%s后解锁",---皮肤解锁提示
	"敬请期待",---皮肤解锁提示
	"默认形象",---皮肤解锁提示
	"永久",
	"天",
	"确定激活该分支进化？",
	"换肤成功",---换肤成功提示
}